blog/artificial-universe-metaphysics.project.org
#+TITLE: No More Playing With "Building Blocks"
#+DATE: <2023-08-22 Tue>
#+SUBTITLE: Protoverse Metaphysics Framework
#+LANGUAGE: en
#+DESCRIPTION: Creating a synthetic universe from scratch
#+KEYWORDS: metaphysics, process philosophy, alife, artificial universe, evolution, natural selection, emergence, dynamic systems, chaos theory
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/artificial-universe-metaphysics.project.html">
#+SETUPFILE: ../static/setup.org
#+OPTIONS: toc:3

#+begin_box
*WORK IN PROGRESS ---* Just landed here? Then you may want to check out the [[file:artificial-universe-introduction.project.org][introduction]] first, which explains what this is about, and what not.

Here is the current version of the metaphysics, an informal framework for the Protoverse. The framework is speculative in large parts and still unpolished, and it doesn't consider practicability or technical feasibility. Once the metphysics feel integrated enough, I'm going to map the philosophical aspects to a computational model.
#+end_box

* The Process-relational Worldview

** Objects

#+begin_quote
"I see and touch these things? Are they not ... there?"
#+end_quote

It comes quite "natural" for us to view the world as an assembly of objects or discrete entities -- The neighbor's dog's long nose, justice, this book, my kitchen, the 3 body problem -- are conventionally understood as "objects" in the broadest sense — somehow more or less discrete "things" that "are". It's largely an /intuitive/ perspective. We're even having a special type of label for those things in our languages -- the noun.

#+begin_quote
"These things are there if you believe, sort of. It's just ... they are not what they seem ... because first and foremost, they are not "things"; and secondly, they not are ..."
@@html:&ast;@@X-Files melody playing@@html:&ast;@@;
#+end_quote

Concepts of "objects" with inherent "properties" seem an universal feature across human culture. However, there are some philosophical traditions unlike western philosophy, such as certain schools within Buddhism, where processual views of the universe are more the rule than exception: acknowledging flux, change and [[https://en.wikipedia.org/wiki/Prat%C4%ABtyasamutp%C4%81da][dependent origination]] rather than distinct, static objects.

Discrete objects seem to be most likely a result of cognitive evolution in humans and other animals. In non-human perception, the idea of objects might be subordinate, radically different, or even non-existent. We do not know too much about how other life's experiences and cognition, but this view might stimulate us to reconsider our methods and their limitations to understanding the arrangement beond human reality:

While humans primarily orient themselves visually, other animals rely more on sounds, smells, electric fields, or vibrations to various extends. For instance, dogs rely heavily on smell to make sense of the world. Even more than that -- dogs seem not to trust their eyes at all; their nose is the final instance. This kind of perception seems not so much centered on "objects", but includes olfactory landscapes that map out overlapping scent trails, conveying a wealth of process information such as the passage of time and the activities and even mood of other creatures.

