blog/artificial-universe-metaphysics.project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-02 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>No More Playing With "Building Blocks"</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Creating a synthetic universe from scratch" />
<meta name="keywords" content="metaphysics, process philosophy, alife, artificial universe, evolution, natural selection, emergence, dynamic systems, chaos theory" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/cormorant/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-basic/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/mononoki/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/artificial-universe-metaphysics.project.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2024-01-27">Last updated: 2024-01-27</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">No More Playing With &ldquo;Building Blocks&rdquo;</h1>
<p class="subtitle" role="doc-subtitle">Protoverse Metaphysics Framework</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdf3e725">The Process-relational Worldview</a>
<ul>
<li><a href="#orgc63a138">Objects</a>
<ul>
<li><a href="#orgb91e06f">There is no Spoon</a></li>
<li><a href="#org0e767e1">Hello Anthropocentrism, My Old Friend</a></li>
</ul>
</li>
<li><a href="#orgd4235ed">What are Numbers Really?</a>
<ul>
<li><a href="#org71981fe">Infinity</a></li>
</ul>
</li>
<li><a href="#orga8f1841">Time, Space and the &ldquo;Laws of Physics&rdquo;</a>
<ul>
<li><a href="#orgf883d25">The Geometry of The Universe</a></li>
<li><a href="#orgaf8dcc0">Causation and Time</a></li>
<li><a href="#orgc0a6201">Space</a></li>
<li><a href="#org83da5e5">Bootstrapping</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb54af1a">What are Processes?</a>
<ul>
<li><a href="#orgd84d5db">Process as the Primary Abstraction</a></li>
<li><a href="#org1a9d076">From Subjective Experience to Shared Realities</a></li>
<li><a href="#orgf976ef6">Process Scoping &#x2013; Access to Information</a>
<ul>
<li><a href="#org7ba2592">Towards Evolving Scope</a></li>
<li><a href="#org1ff0377">Ideas for Scope Models</a></li>
<li><a href="#orgf73aca9">How can Processes Account for Shared Realities?</a></li>
<li><a href="#org86d6d81">The &ldquo;Abstract&rdquo; vs. &ldquo;Concrete&rdquo; Dichotomy</a></li>
<li><a href="#orgeb8f46c">The Problem of Universals</a></li>
<li><a href="#orged9f95c">Conceptual Pluralism</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org108dcdb">Interacting Processes</a>
<ul>
<li><a href="#org3a02ac9">Difference and Equality</a>
<ul>
<li><a href="#org9e75c7b">Identity &#x2013; the Self-relation</a></li>
<li><a href="#org13493aa">Baseline or Reference</a></li>
<li><a href="#org82db234">Inherent Uncertainty</a></li>
<li><a href="#org0c29c13">Navigating Uncertainty</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3037ffe">General Darwinian Evolution</a>
<ul>
<li><a href="#org6523cea">Algorithmic Nature of Evolution</a></li>
<li><a href="#org56f498f">The Stages of Evolutionary Processes</a>
<ul>
<li><a href="#org61f5f72">Variety</a></li>
<li><a href="#orgeaa05e3">Selection</a></li>
<li><a href="#org7723820">Retention</a></li>
<li><a href="#orga2b4820">Repetition</a></li>
</ul>
</li>
<li><a href="#org6c61d25">Nested Scales of Emergence</a>
<ul>
<li><a href="#org9f291e5">Phase Transitions</a></li>
<li><a href="#orgb327d37">Do Nested Scales of Emergence Become Increasingly Complex?</a></li>
<li><a href="#orga65c79d">There are No Privileged Nested Scales of Emergence</a></li>
</ul>
</li>
<li><a href="#orgcea2a39">Meta-Evolution</a>
<ul>
<li><a href="#org7c0d69d">Examples</a></li>
<li><a href="#orgd37ba61">Research Concerning the Evolution of Evolution (Meta-Evolution)</a></li>
<li><a href="#org19cddad">Entropy and its Relation to Evolutionary Processes</a></li>
<li><a href="#org3d4591d">Reception of Universal Darwinism</a></li>
</ul>
</li>
<li><a href="#orgdbfdb99">Darwin-style Evolution in a Synthetic Universe</a>
<ul>
<li><a href="#orge7a5fbd">Necessary Conditions for Open-Ended Evolution</a></li>
<li><a href="#orgc302bc9">Drivers of Computational Evolution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org00aebe0">Meta</a>
<ul>
<li><a href="#orge2468f4">Design Guidelines</a></li>
</ul>
</li>
<li><a href="#org430e714">Scratchpad</a>
<ul>
<li><a href="#orgc7a4c6f">Felt like it meant something; might delete later</a>
<ul>
<li><a href="#org82eab89">Delimited Relational State Update</a></li>
<li><a href="#orgd8c0114">Is There an Ultimate Reality?</a></li>
<li><a href="#org3b6c009">Relevant beliefs and values:</a></li>
<li><a href="#org98e0d32">Cognitive object-heuristic and Platonic thinking</a></li>
<li><a href="#org2b18998">Approximation and Uncertainty in Nature:</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
<div class="box" id="org5972c04">
<p>
<b>WORK IN PROGRESS ---</b> Just landed here? Then you may want to check out the <a href="artificial-universe-introduction.project.html">introduction</a> first, which explains what this is about, and what not.<br>
</p>

<p>
Here is the current version of the metaphysics, an informal framework for the Protoverse. The framework is speculative in large parts and still unpolished, and it doesn&rsquo;t consider practicability or technical feasibility. Once the metphysics feel integrated enough, I&rsquo;m going to map the philosophical aspects to a computational model.<br>
</p>

</div>

<div id="outline-container-orgdf3e725" class="outline-2">
<h2 id="orgdf3e725"><a href="#orgdf3e725">The Process-relational Worldview</a></h2>
<div class="outline-text-2" id="text-orgdf3e725">
</div>
<div id="outline-container-orgc63a138" class="outline-3">
<h3 id="orgc63a138"><a href="#orgc63a138">Objects</a></h3>
<div class="outline-text-3" id="text-orgc63a138">
<blockquote>
<p>
&ldquo;I see and touch these things? Are they not &#x2026; there?&rdquo;<br>
</p>
</blockquote>

<p>
It comes quite &ldquo;natural&rdquo; for us to view the world as an assembly of objects or discrete entities &#x2013; The neighbor&rsquo;s dog&rsquo;s long nose, justice, this book, my kitchen, the 3 body problem &#x2013; are conventionally understood as &ldquo;objects&rdquo; in the broadest sense — somehow more or less discrete &ldquo;things&rdquo; that &ldquo;are&rdquo;. It&rsquo;s largely an <i>intuitive</i> perspective. We&rsquo;re even having a special type of label for those things in our languages &#x2013; the noun.<br>
</p>

<blockquote>
<p>
&ldquo;These things are there if you believe, sort of. It&rsquo;s just &#x2026; they are not what they seem &#x2026; because first and foremost, they are not &rdquo;things&ldquo;; and secondly, they not are &#x2026;&rdquo;<br>
&ast;X-Files melody playing&ast;;<br>
</p>
</blockquote>

<p>
Concepts of &ldquo;objects&rdquo; with inherent &ldquo;properties&rdquo; seem an universal feature across human culture. However, there are some philosophical traditions unlike western philosophy, such as certain schools within Buddhism, where processual views of the universe are more the rule than exception: acknowledging flux, change and <a href="https://en.wikipedia.org/wiki/Prat%C4%ABtyasamutp%C4%81da">dependent origination</a> rather than distinct, static objects.<br>
</p>

<p>
Discrete objects seem to be most likely a result of cognitive evolution in humans and other animals. In non-human perception, the idea of objects might be subordinate, radically different, or even non-existent. We do not know too much about how other life&rsquo;s experiences and cognition, but this view might stimulate us to reconsider our methods and their limitations to understanding the arrangement beond human reality:<br>
</p>

<p>
While humans primarily orient themselves visually, other animals rely more on sounds, smells, electric fields, or vibrations to various extends. For instance, dogs rely heavily on smell to make sense of the world. Even more than that &#x2013; dogs seem not to trust their eyes at all; their nose is the final instance. This kind of perception seems not so much centered on &ldquo;objects&rdquo;, but includes olfactory landscapes that map out overlapping scent trails, conveying a wealth of process information such as the passage of time and the activities and even mood of other creatures.<br>
</p>
</div>
