blog/artificial-universe-metaphysics.project.org
*** There is no Spoon

Have you ever experienced that: You're sitting at the beach, watching the sun disappear behind the horizon — and suddenly there comes this moment of awe, where you realize that it is the ground that tilts beneath you? You experience the vast sphere rolling backwards away from the diminishing light, taking you with it? (The effect is best experienced when there are no distractions in your peripheral vision -- e.g. you sit on a spit -- so that you see nothing but the beach, water and the sky)

The realization that there are in fact no stable objects, no "things" to find anywhere you look, comes more gradually though. Like in my the example concering the rotating earth, the intensity of that experience has to do with our perception of time — and wether you can detect a notion of change or not (it also helps to watch timelapses).

And it helps to zoom out and set the time of an average human's lifespan in relation with the earth's or the universe's estimated age, and you realize there's actually nothing intrinsically special about what we consider "vast" or "incredibly tiny". Once you arrived there, you might assign much less significance to "objects", or hold on to a static, stable and substantial understanding of reality.

Change can be frightening. Change underlies the unknown, the unstable and uncertain. Humans likes "to break things down" into neat pieces: In order to create the object-illusion, cognition splits perception into discrete dimensions, removes these dimensions from context and augments the results with mind-borne constructs, It does it so well, so that it feels like entirely real, "out there", which eventually leads to the idea of "objects" with "inherent properties".

All objects, regardless of their typical 'real' or 'abstract' categorizations, should be regarded as /epiphenomena/ -- approximate and incomplete descriptions of the underlying, ever-changing processes.

They are results of a cognitive process that provides essentially a subjective, reductionist simplification that we commonly call "reality".

It doesn't mean that the object-heuristic is bad or we shouldn't use this abstraction — it is not bad in the same sense a spoon is not bad for soup. Objects are quite often helpful. But this cheaply available heuristic does not make objects to fundamental "building blockss" /(← see?)/ of reality, the universe and everything.

We'll need to consider a paradigm shift to a worldview in terms of /process, relation and transformation/, to finally get out of the stuffy theater where the 'particles' dance to the beat of 'time' on a stage of 'space'.

*** Hello Anthropocentrism, My Old Friend

A whole "universe" has been created around the idea of 'objects' in various manifestations, e.g. 'person', 'number' or 'particle', assuming that they must be somehow special, important or fundamental — just because they seem so /intuitive/ — "I think, therefore they are", no? Who in his right mind could deny that?

There are numerous hints, that we long ago entered territory where our intuitive concept of a substance-based reality is a hindrance, has lost it's use, or entirely fallen apart: when grappling with abstract concepts (like emotions, mathematics, software), emergent phenomena (like businesses or complex systems), and fields on the edge of human knowledge (such as neuroscience or quantum physics).

Our theories might be much more contingent on human intuition than we usually admit.

#+begin_quote
If all you have is a hammer, everything looks like a nail
#+end_quote

Wouldn't it be quite a stretch to assume that a primitive cognitive pattern-recognition heuristic, evolved towards optimizing for survival and reproduction in a range of animals adapted to earth-bound environments, could be adequate to make sense of the universe and reality at all scales?

Of course, that's not the whole story: Certainly, humans are developing tools and methods like mathematics and technology to overcome their limitations. But a closer look reveals that most of these methods are built on the the same substance-fundamentalist preconceptions.

Certain phenomena may only /appear paradoxical/ because we use inadequate abstractions to begin with. What about the particle zoo, the 1001 interpretations of quantum mechanics, particle-wave duality? I'm notoriously bad with "concrete real-world examples" outside of my special interests, so I may ask you: What else?

The nasty habit to objectify /everything/ may cause us to miss important subtleties, so that there will be subtly growing gaps in our understanding of ever-changing complex systems, as long as we fail to /update our repertoire of intuitions/.

