blog/artificial-universe-metaphysics.project.html

<div id="outline-container-orgb91e06f" class="outline-4">
<h4 id="orgb91e06f"><a href="#orgb91e06f">There is no Spoon</a></h4>
<div class="outline-text-4" id="text-orgb91e06f">
<p>
Have you ever experienced that: You&rsquo;re sitting at the beach, watching the sun disappear behind the horizon — and suddenly there comes this moment of awe, where you realize that it is the ground that tilts beneath you? You experience the vast sphere rolling backwards away from the diminishing light, taking you with it? (The effect is best experienced when there are no distractions in your peripheral vision &#x2013; e.g. you sit on a spit &#x2013; so that you see nothing but the beach, water and the sky)<br>
</p>

<p>
The realization that there are in fact no stable objects, no &ldquo;things&rdquo; to find anywhere you look, comes more gradually though. Like in my the example concering the rotating earth, the intensity of that experience has to do with our perception of time — and wether you can detect a notion of change or not (it also helps to watch timelapses).<br>
</p>

<p>
And it helps to zoom out and set the time of an average human&rsquo;s lifespan in relation with the earth&rsquo;s or the universe&rsquo;s estimated age, and you realize there&rsquo;s actually nothing intrinsically special about what we consider &ldquo;vast&rdquo; or &ldquo;incredibly tiny&rdquo;. Once you arrived there, you might assign much less significance to &ldquo;objects&rdquo;, or hold on to a static, stable and substantial understanding of reality.<br>
</p>

<p>
Change can be frightening. Change underlies the unknown, the unstable and uncertain. Humans likes &ldquo;to break things down&rdquo; into neat pieces: In order to create the object-illusion, cognition splits perception into discrete dimensions, removes these dimensions from context and augments the results with mind-borne constructs, It does it so well, so that it feels like entirely real, &ldquo;out there&rdquo;, which eventually leads to the idea of &ldquo;objects&rdquo; with &ldquo;inherent properties&rdquo;.<br>
</p>

<p>
All objects, regardless of their typical &rsquo;real&rsquo; or &rsquo;abstract&rsquo; categorizations, should be regarded as <i>epiphenomena</i> &#x2013; approximate and incomplete descriptions of the underlying, ever-changing processes.<br>
</p>

<p>
They are results of a cognitive process that provides essentially a subjective, reductionist simplification that we commonly call &ldquo;reality&rdquo;.<br>
</p>

<p>
It doesn&rsquo;t mean that the object-heuristic is bad or we shouldn&rsquo;t use this abstraction — it is not bad in the same sense a spoon is not bad for soup. Objects are quite often helpful. But this cheaply available heuristic does not make objects to fundamental &ldquo;building blockss&rdquo; <i>(← see?)</i> of reality, the universe and everything.<br>
</p>

<p>
We&rsquo;ll need to consider a paradigm shift to a worldview in terms of <i>process, relation and transformation</i>, to finally get out of the stuffy theater where the &rsquo;particles&rsquo; dance to the beat of &rsquo;time&rsquo; on a stage of &rsquo;space&rsquo;.<br>
</p>
</div>
</div>

<div id="outline-container-org0e767e1" class="outline-4">
<h4 id="org0e767e1"><a href="#org0e767e1">Hello Anthropocentrism, My Old Friend</a></h4>
<div class="outline-text-4" id="text-org0e767e1">
<p>
A whole &ldquo;universe&rdquo; has been created around the idea of &rsquo;objects&rsquo; in various manifestations, e.g. &rsquo;person&rsquo;, &rsquo;number&rsquo; or &rsquo;particle&rsquo;, assuming that they must be somehow special, important or fundamental — just because they seem so <i>intuitive</i> — &ldquo;I think, therefore they are&rdquo;, no? Who in his right mind could deny that?<br>
</p>

<p>
There are numerous hints, that we long ago entered territory where our intuitive concept of a substance-based reality is a hindrance, has lost it&rsquo;s use, or entirely fallen apart: when grappling with abstract concepts (like emotions, mathematics, software), emergent phenomena (like businesses or complex systems), and fields on the edge of human knowledge (such as neuroscience or quantum physics).<br>
</p>

<p>
Our theories might be much more contingent on human intuition than we usually admit.<br>
</p>

<blockquote>
<p>
If all you have is a hammer, everything looks like a nail<br>
</p>
</blockquote>

<p>
Wouldn&rsquo;t it be quite a stretch to assume that a primitive cognitive pattern-recognition heuristic, evolved towards optimizing for survival and reproduction in a range of animals adapted to earth-bound environments, could be adequate to make sense of the universe and reality at all scales?<br>
</p>

<p>
Of course, that&rsquo;s not the whole story: Certainly, humans are developing tools and methods like mathematics and technology to overcome their limitations. But a closer look reveals that most of these methods are built on the the same substance-fundamentalist preconceptions.<br>
</p>

<p>
Certain phenomena may only <i>appear paradoxical</i> because we use inadequate abstractions to begin with. What about the particle zoo, the 1001 interpretations of quantum mechanics, particle-wave duality? I&rsquo;m notoriously bad with &ldquo;concrete real-world examples&rdquo; outside of my special interests, so I may ask you: What else?<br>
</p>

<p>
The nasty habit to objectify <i>everything</i> may cause us to miss important subtleties, so that there will be subtly growing gaps in our understanding of ever-changing complex systems, as long as we fail to <i>update our repertoire of intuitions</i>.<br>
</p>
</div>
</div>
</div>
