blog/artificial-universe-metaphysics.project.org
** What are Numbers Really?

Various animal species grasp relative quantities, but only a rare few exhibit a concept of "exact" numbers: Crows do, Squirrels seemingly not. Throughout our animal kingom, numerical cognition majors more on relational aspects (such as 'more', 'less', 'equal', 'numerous', 'few'), rather than strict counting; it highlights that the concept of exactness may not be a universal necessity for "functioning" in the world.

"Exact" numbers though, do seem to require a form of counting or a counting-like process. For instance, the number 65536 can be constructed by certain types of counting processes, as there are multiple ways to arrive at any given "natural" number.

The concept of numbers in the most general sense may be defined as "regular sequence established by the repeated application of a certain rule" (reminiscent of the Peano axioms). It may be debated if the "algorithmic" description is enough for numbers to "exist", or if there's another component required that /instantiates/ the algorithm, runs it -- well, in order to achieve /what/, exactly? To make it available for someone/something to interact with it? For information transfer, basically? Observability? Becoming concrete? Oh, and what about the "algorithmic" description itself? Had something else to instantiate this algorithmic description before? Oops, we got off track.

The algorithm to construct the sequence of the "natural" numbers is by incrementally adding 1 discrete unit at a time ~(n + 1)~ to a previously accumulated pile of units. However, this linear approach to count ~(n + 1)~ might be largely due to a cognitive bias for discrete objects, which in turn could be "historical accident", not just anthropocentrism, but rooted somewhere way down tree of life where the object-abstraction maybe has provided significant advantage -- due to visual senses, which have evolved multiple times independently.

Interestingly, it could be argued that the "more natural" way to count is by /doubling/. Doubling ~(n + n)~ follows an exponential growth rate and is much more prevalent in nature (e.g. cell division and most biological systems) than linear incrementing by 1 ~(n + 1)~. Doubling is even /conceptionally simpler/ than incrementing by 1 -- because it requires less preconceptions (you might realize that when you shovel aside the anthropocentric bias. Fellow wanderer, do you accept the side quest?).

At this point you may contend that the "more natural" counting method by doubling is utter rubbish -- because aren't there a lot of numbers missing? There's no 3, 6, 7, 9 ... ? So, this number sequence does not provide direct access to "all" numbers? Well, neither does the usual ~(n + 1)~ number sequence -- it only gives you "natural numbers", but no 9¾, which would still cause you to miss the train.

At the heart of doubling is the concept of halving, essentially two sides of the same coin. But in order to arrive at a scenario where splitting a discrete unit into /arbitrary/ fractions becomes feasible, we'll need to break out of this number system and find ourselves within the system of rational numbers. And we'll need to break out of several schemas in order to float freely in the continuum or "number universe" where we could directly "access", "construct" or "manifest" all numbers.

There are countless algorithms that give rise to regular number sequences (e.g. the fibonacci sequence), which could be used for counting and other numerical operations. In order to give rise to the endless number sequences we all know and love, these algorithms just have to be defined so that the algorithms repeat infinitely.

Ok, so numbers are actually nothing more than sequences built on arbritrary, regular relations. And our "natural" numbers or integers are just as arbritary, because any number only acquires meaning in relation to the particularly defined sequence it happens to be part of by definition.

It makes no sense to think of the apparent properties (of numbers) as inherent of particular numbers -- they're relational to the "encompassing" system that implies the properties. You may not like it, but 3 and 3 are not neccessarily the same -- only within the same number system (strictly speaking -- mathematics ignores a lot of stuff for convenience). If you still disagree, then here's what might have happened: you've confused the concept of number with the label "3"; you created informally an ad-hoc a distinct number system where this is true by definition; or both. But then, you could go on and realize inifinitely many properties "in" anything, even so in the relation to the number 3, because no constraints apply.

Whatever number sequences we choose to base numerical operations on may /highlight certain aspects and obscure others/. The number sequence chosen may result in making certain calculations easier, others more difficult, and even /impossible/ (if one really adheres strictly to the defined sequence and doesn't break out ad-hoc).

From the common substantial-materialist point of view, properties seem to be "external" of the "object" in question, which may look kinda weird to you. But that's only because this /perspective/ presupposes "standalone" entities, and therefore implies that "properties" must be somehow "within". This is related to our deeply rooted habit of drawing borders ad-hoc and arbitrarily, and touches Goedel's incompleteness theorem /[I should expand on this in the section about systems]/

From all propable configurations of states -- of which none is inherently special -- algorithms make certain states /particular/.

We now may accept there's nothing special or fundamental about "numbers", which was the initial, but not solely reason for this exercise. Their meaning is not absolute, but entirely relational. But relational to /what/?

*** Infinity

The widely accepted invention of 'completed infinity' (also known by the euphemism 'actual infinity') literally means "the finished unfinished" and is a contradiction in itself, like the "square circle".

It's an attempt to force the concept of potential infinity (an endless /process/) into the object-centric paradigm, aligning it with the dominant thought and human bias to portray things as "concluded", "finished", "discrete" and "precise".

Instead, I suggest to /embrace the infinite/ and the incomplete as the crucial driver of the "reality, the universe and everything" -- /that there can be -- and actually are -- "things" that cannot be "finished" by any means may be significant for anything to exist at all./

This touches up onto the habits of how to draw boundaries (dichotomies like beginnings/ends, inner/outer) of systems in a general sense. It will be interesting to revisit this in the light of Gödel's incompleteness theorem in combination with the implications of the process-relational ontology (which are scattered all over this framework).

