blog/artificial-universe-metaphysics.project.html

<div id="outline-container-orgd4235ed" class="outline-3">
<h3 id="orgd4235ed"><a href="#orgd4235ed">What are Numbers Really?</a></h3>
<div class="outline-text-3" id="text-orgd4235ed">
<p>
Various animal species grasp relative quantities, but only a rare few exhibit a concept of &ldquo;exact&rdquo; numbers: Crows do, Squirrels seemingly not. Throughout our animal kingom, numerical cognition majors more on relational aspects (such as &rsquo;more&rsquo;, &rsquo;less&rsquo;, &rsquo;equal&rsquo;, &rsquo;numerous&rsquo;, &rsquo;few&rsquo;), rather than strict counting; it highlights that the concept of exactness may not be a universal necessity for &ldquo;functioning&rdquo; in the world.<br>
</p>

<p>
&ldquo;Exact&rdquo; numbers though, do seem to require a form of counting or a counting-like process. For instance, the number 65536 can be constructed by certain types of counting processes, as there are multiple ways to arrive at any given &ldquo;natural&rdquo; number.<br>
</p>

<p>
The concept of numbers in the most general sense may be defined as &ldquo;regular sequence established by the repeated application of a certain rule&rdquo; (reminiscent of the Peano axioms). It may be debated if the &ldquo;algorithmic&rdquo; description is enough for numbers to &ldquo;exist&rdquo;, or if there&rsquo;s another component required that <i>instantiates</i> the algorithm, runs it &#x2013; well, in order to achieve <i>what</i>, exactly? To make it available for someone/something to interact with it? For information transfer, basically? Observability? Becoming concrete? Oh, and what about the &ldquo;algorithmic&rdquo; description itself? Had something else to instantiate this algorithmic description before? Oops, we got off track.<br>
</p>

<p>
The algorithm to construct the sequence of the &ldquo;natural&rdquo; numbers is by incrementally adding 1 discrete unit at a time <code>(n + 1)</code> to a previously accumulated pile of units. However, this linear approach to count <code>(n + 1)</code> might be largely due to a cognitive bias for discrete objects, which in turn could be &ldquo;historical accident&rdquo;, not just anthropocentrism, but rooted somewhere way down tree of life where the object-abstraction maybe has provided significant advantage &#x2013; due to visual senses, which have evolved multiple times independently.<br>
</p>

<p>
Interestingly, it could be argued that the &ldquo;more natural&rdquo; way to count is by <i>doubling</i>. Doubling <code>(n + n)</code> follows an exponential growth rate and is much more prevalent in nature (e.g. cell division and most biological systems) than linear incrementing by 1 <code>(n + 1)</code>. Doubling is even <i>conceptionally simpler</i> than incrementing by 1 &#x2013; because it requires less preconceptions (you might realize that when you shovel aside the anthropocentric bias. Fellow wanderer, do you accept the side quest?).<br>
</p>

<p>
At this point you may contend that the &ldquo;more natural&rdquo; counting method by doubling is utter rubbish &#x2013; because aren&rsquo;t there a lot of numbers missing? There&rsquo;s no 3, 6, 7, 9 &#x2026; ? So, this number sequence does not provide direct access to &ldquo;all&rdquo; numbers? Well, neither does the usual <code>(n + 1)</code> number sequence &#x2013; it only gives you &ldquo;natural numbers&rdquo;, but no 9¾, which would still cause you to miss the train.<br>
</p>

<p>
At the heart of doubling is the concept of halving, essentially two sides of the same coin. But in order to arrive at a scenario where splitting a discrete unit into <i>arbitrary</i> fractions becomes feasible, we&rsquo;ll need to break out of this number system and find ourselves within the system of rational numbers. And we&rsquo;ll need to break out of several schemas in order to float freely in the continuum or &ldquo;number universe&rdquo; where we could directly &ldquo;access&rdquo;, &ldquo;construct&rdquo; or &ldquo;manifest&rdquo; all numbers.<br>
</p>

<p>
There are countless algorithms that give rise to regular number sequences (e.g. the fibonacci sequence), which could be used for counting and other numerical operations. In order to give rise to the endless number sequences we all know and love, these algorithms just have to be defined so that the algorithms repeat infinitely.<br>
</p>

<p>
Ok, so numbers are actually nothing more than sequences built on arbritrary, regular relations. And our &ldquo;natural&rdquo; numbers or integers are just as arbritary, because any number only acquires meaning in relation to the particularly defined sequence it happens to be part of by definition.<br>
</p>

<p>
It makes no sense to think of the apparent properties (of numbers) as inherent of particular numbers &#x2013; they&rsquo;re relational to the &ldquo;encompassing&rdquo; system that implies the properties. You may not like it, but 3 and 3 are not neccessarily the same &#x2013; only within the same number system (strictly speaking &#x2013; mathematics ignores a lot of stuff for convenience). If you still disagree, then here&rsquo;s what might have happened: you&rsquo;ve confused the concept of number with the label &ldquo;3&rdquo;; you created informally an ad-hoc a distinct number system where this is true by definition; or both. But then, you could go on and realize inifinitely many properties &ldquo;in&rdquo; anything, even so in the relation to the number 3, because no constraints apply.<br>
</p>

<p>
Whatever number sequences we choose to base numerical operations on may <i>highlight certain aspects and obscure others</i>. The number sequence chosen may result in making certain calculations easier, others more difficult, and even <i>impossible</i> (if one really adheres strictly to the defined sequence and doesn&rsquo;t break out ad-hoc).<br>
</p>

<p>
From the common substantial-materialist point of view, properties seem to be &ldquo;external&rdquo; of the &ldquo;object&rdquo; in question, which may look kinda weird to you. But that&rsquo;s only because this <i>perspective</i> presupposes &ldquo;standalone&rdquo; entities, and therefore implies that &ldquo;properties&rdquo; must be somehow &ldquo;within&rdquo;. This is related to our deeply rooted habit of drawing borders ad-hoc and arbitrarily, and touches Goedel&rsquo;s incompleteness theorem <i>[I should expand on this in the section about systems]</i><br>
</p>

<p>
From all propable configurations of states &#x2013; of which none is inherently special &#x2013; algorithms make certain states <i>particular</i>.<br>
</p>

<p>
We now may accept there&rsquo;s nothing special or fundamental about &ldquo;numbers&rdquo;, which was the initial, but not solely reason for this exercise. Their meaning is not absolute, but entirely relational. But relational to <i>what</i>?<br>
</p>
</div>

<div id="outline-container-org71981fe" class="outline-4">
<h4 id="org71981fe"><a href="#org71981fe">Infinity</a></h4>
<div class="outline-text-4" id="text-org71981fe">
<p>
The widely accepted invention of &rsquo;completed infinity&rsquo; (also known by the euphemism &rsquo;actual infinity&rsquo;) literally means &ldquo;the finished unfinished&rdquo; and is a contradiction in itself, like the &ldquo;square circle&rdquo;.<br>
</p>

<p>
It&rsquo;s an attempt to force the concept of potential infinity (an endless <i>process</i>) into the object-centric paradigm, aligning it with the dominant thought and human bias to portray things as &ldquo;concluded&rdquo;, &ldquo;finished&rdquo;, &ldquo;discrete&rdquo; and &ldquo;precise&rdquo;.<br>
</p>

<p>
Instead, I suggest to <i>embrace the infinite</i> and the incomplete as the crucial driver of the &ldquo;reality, the universe and everything&rdquo; &#x2013; <i>that there can be &#x2013; and actually are &#x2013; &ldquo;things&rdquo; that cannot be &ldquo;finished&rdquo; by any means may be significant for anything to exist at all.</i><br>
</p>

<p>
This touches up onto the habits of how to draw boundaries (dichotomies like beginnings/ends, inner/outer) of systems in a general sense. It will be interesting to revisit this in the light of Gödel&rsquo;s incompleteness theorem in combination with the implications of the process-relational ontology (which are scattered all over this framework).<br>
</p>
</div>
</div>
</div>
