blog/artificial-universe-metaphysics.project.org
** Time, Space and the "Laws of Physics"

Given that I adopt a bottom-up approach when designing the Protoverse, the fundamental premise is that all phenomena are emergent by nature. Only when this assumption ceases to provide meaningful insights, I do consider classifying the phenomenon in question as fundamental.

Hence, instead of assuming that time, space and the laws of physics are fundamental, I propose that these are merely emergent phenomena and suggest a "Nested Scales of Emergence" model, where complex systems emerge within other complex systems, following their predominantly own, higher-order dynamics — akin to our universe's apparent Nested Scales of Emergence: from a quantum Scale, macro-relativistic, chemical-biological, societal, technological, information-computational, and beyond.

I prefer the term 'Scales' instead of 'layers' in order to avoid the impression that these are tree-like hierarchical. Emergent phenomena at attributed to each Scale can influence the behavior and evolution of other Scales and ultimately the entirety of the system.

*** The Geometry of The Universe

Speculations about the grand "shape" are usually made in terms of /space/, because 'space' is the most intuitively experienceable abstraction (in combination with "object"), which we commonly associate with 'shape'. It would be a bit weird to think about "the universe" predominantly in terms of "space", for presumably the sole reason that the spatial relation is for us the most prominent by far, and the one that whe are able to discriminate best.

If we would live in a "Colorverse", that would like describing the Colorverse primarily in /hues of green/, because we distinguish best between different greens, and therefore green would take up the largest part of awareness in the Colorverse.

Time feels much more mysterious than space, and through Einstein's contribution we arrived at a relativistic understanding of spacetime.

In our Colorverse, hues of "green" have been mingled together with a brightness dimension, leading to shades of green. There's much more freedom in the color universe: you can choose in which direction things will go! Towards the eternal light, or towards eternal darkness? Pick one! Choose wisely.

What about the other colors in the Colorverse? Well, they seem to be there, but no one thinks about them really. Some Colorverse physicists propose that the reds have collapsed into infinitesimal small dimensions.

While it might be tempting to imagine this "structure", it would depend on relative /Properties/ (realized relational states) that interacting Processes may lay upon it (as discussed earlier), so there wouldn't be an absolute or defintive structure that involves all the nested scales, network dynamics, and fractal nature. But one thing is certain: It is very likely bigger from the inside than from the outside.

*** Causation and Time

Right now I can't find no compelling reason to introduce time as a fundamental. We could simply say that "time" emerges merely via cause and effect (at least according to my current understanding), which could be interpreted as sequences of 'befores' and 'afters' (but don't have to).

Thus, causation can be argued as prior to "time" (the other way around seems less sensible to me). Like I hinted before, we could unify time into – no, not into "spacetime" — but into Process. I do not presume time to be an intrinsic component or a universal feature underpinning Process, hence Process is not an abstraction over time.

While building a self-evolving synthetic universe, one thing that may come to mind is the problem of the "initial rules" (the governing laws -- can be thought as the functions) and the "initial conditions" (the specific state at the beginning -- like inputs to the functions).

Could we transcend the dichotomy of 'inital rules' and 'initial conditions'? So that there will be neither, but something else in their place?



A synthetic universe which is not entirely subject to its initial rules/conditions, but is somehow very much able to diverge from its fundamentals (at least in its various scales), seems like a basic requirement to make it viable. There are some considerations:

The system could spawn (fractal-like) scales.

It could happen that it spawns scales that are not viable -- e.g. that converge to boring states or which are too chaotic. These non-viable scales then either continue to exist in this state, collapse, or otherwise chease to exist for some reason, e.g. through a form of "entropy". Even though it may be shockingly close to a many-worlds conception, it doesn't mean that these "worlds" have to be isolated from each other.

We'd like to avoid predefining fundamentals as much as possible, teleological



The idea of recursion could be enough to 'change' initial conditions, in an /immutable/ way, which fits quite elegantly into this computable universe. The Protoverse' logic could learn to identify 'favorable' states and ways to reach them more efficiently or effectively. It could spawn new dynamics previously impossible under its original rule set. Ultimately, it could build an iterative learning and self-improvement mechanism into the fabric of our universe model by utilizing recursion in a way that's consistent, self-contained, and aligned with our objectives for exploration of emergent phenomena.

We could introduce the idea that causes and effects are not determined by definitive states, but /probabilities/ all the way down. Then, an effect could "exists in the future" as a probability, until they are evaluated/reduced by the 'present' and therefore determined from there on, as they vanish deeper into the past forever and ever and ever. Does that make any sense? Yes? No? /Probably?/

Circular causation is the rule rather than an exception. Causation is prior to time, retro-causality is uneccessary.

