blog/artificial-universe-metaphysics.project.html

<div id="outline-container-orga8f1841" class="outline-3">
<h3 id="orga8f1841"><a href="#orga8f1841">Time, Space and the &ldquo;Laws of Physics&rdquo;</a></h3>
<div class="outline-text-3" id="text-orga8f1841">
<p>
Given that I adopt a bottom-up approach when designing the Protoverse, the fundamental premise is that all phenomena are emergent by nature. Only when this assumption ceases to provide meaningful insights, I do consider classifying the phenomenon in question as fundamental.<br>
</p>

<p>
Hence, instead of assuming that time, space and the laws of physics are fundamental, I propose that these are merely emergent phenomena and suggest a &ldquo;Nested Scales of Emergence&rdquo; model, where complex systems emerge within other complex systems, following their predominantly own, higher-order dynamics — akin to our universe&rsquo;s apparent Nested Scales of Emergence: from a quantum Scale, macro-relativistic, chemical-biological, societal, technological, information-computational, and beyond.<br>
</p>

<p>
I prefer the term &rsquo;Scales&rsquo; instead of &rsquo;layers&rsquo; in order to avoid the impression that these are tree-like hierarchical. Emergent phenomena at attributed to each Scale can influence the behavior and evolution of other Scales and ultimately the entirety of the system.<br>
</p>
</div>

<div id="outline-container-orgf883d25" class="outline-4">
<h4 id="orgf883d25"><a href="#orgf883d25">The Geometry of The Universe</a></h4>
<div class="outline-text-4" id="text-orgf883d25">
<p>
Speculations about the grand &ldquo;shape&rdquo; are usually made in terms of <i>space</i>, because &rsquo;space&rsquo; is the most intuitively experienceable abstraction (in combination with &ldquo;object&rdquo;), which we commonly associate with &rsquo;shape&rsquo;. It would be a bit weird to think about &ldquo;the universe&rdquo; predominantly in terms of &ldquo;space&rdquo;, for presumably the sole reason that the spatial relation is for us the most prominent by far, and the one that whe are able to discriminate best.<br>
</p>

<p>
If we would live in a &ldquo;Colorverse&rdquo;, that would like describing the Colorverse primarily in <i>hues of green</i>, because we distinguish best between different greens, and therefore green would take up the largest part of awareness in the Colorverse.<br>
</p>

<p>
Time feels much more mysterious than space, and through Einstein&rsquo;s contribution we arrived at a relativistic understanding of spacetime.<br>
</p>

<p>
In our Colorverse, hues of &ldquo;green&rdquo; have been mingled together with a brightness dimension, leading to shades of green. There&rsquo;s much more freedom in the color universe: you can choose in which direction things will go! Towards the eternal light, or towards eternal darkness? Pick one! Choose wisely.<br>
</p>

<p>
What about the other colors in the Colorverse? Well, they seem to be there, but no one thinks about them really. Some Colorverse physicists propose that the reds have collapsed into infinitesimal small dimensions.<br>
</p>

<p>
While it might be tempting to imagine this &ldquo;structure&rdquo;, it would depend on relative <i>Properties</i> (realized relational states) that interacting Processes may lay upon it (as discussed earlier), so there wouldn&rsquo;t be an absolute or defintive structure that involves all the nested scales, network dynamics, and fractal nature. But one thing is certain: It is very likely bigger from the inside than from the outside.<br>
</p>
</div>
</div>

<div id="outline-container-orgaf8dcc0" class="outline-4">
<h4 id="orgaf8dcc0"><a href="#orgaf8dcc0">Causation and Time</a></h4>
<div class="outline-text-4" id="text-orgaf8dcc0">
<p>
Right now I can&rsquo;t find no compelling reason to introduce time as a fundamental. We could simply say that &ldquo;time&rdquo; emerges merely via cause and effect (at least according to my current understanding), which could be interpreted as sequences of &rsquo;befores&rsquo; and &rsquo;afters&rsquo; (but don&rsquo;t have to).<br>
</p>

<p>
Thus, causation can be argued as prior to &ldquo;time&rdquo; (the other way around seems less sensible to me). Like I hinted before, we could unify time into – no, not into &ldquo;spacetime&rdquo; — but into Process. I do not presume time to be an intrinsic component or a universal feature underpinning Process, hence Process is not an abstraction over time.<br>
</p>

<p>
While building a self-evolving synthetic universe, one thing that may come to mind is the problem of the &ldquo;initial rules&rdquo; (the governing laws &#x2013; can be thought as the functions) and the &ldquo;initial conditions&rdquo; (the specific state at the beginning &#x2013; like inputs to the functions).<br>
</p>

<p>
Could we transcend the dichotomy of &rsquo;inital rules&rsquo; and &rsquo;initial conditions&rsquo;? So that there will be neither, but something else in their place?<br>
</p>



<p>
A synthetic universe which is not entirely subject to its initial rules/conditions, but is somehow very much able to diverge from its fundamentals (at least in its various scales), seems like a basic requirement to make it viable. There are some considerations:<br>
</p>

<p>
The system could spawn (fractal-like) scales.<br>
</p>

<p>
It could happen that it spawns scales that are not viable &#x2013; e.g. that converge to boring states or which are too chaotic. These non-viable scales then either continue to exist in this state, collapse, or otherwise chease to exist for some reason, e.g. through a form of &ldquo;entropy&rdquo;. Even though it may be shockingly close to a many-worlds conception, it doesn&rsquo;t mean that these &ldquo;worlds&rdquo; have to be isolated from each other.<br>
</p>

<p>
We&rsquo;d like to avoid predefining fundamentals as much as possible, teleological<br>
</p>



<p>
The idea of recursion could be enough to &rsquo;change&rsquo; initial conditions, in an <i>immutable</i> way, which fits quite elegantly into this computable universe. The Protoverse&rsquo; logic could learn to identify &rsquo;favorable&rsquo; states and ways to reach them more efficiently or effectively. It could spawn new dynamics previously impossible under its original rule set. Ultimately, it could build an iterative learning and self-improvement mechanism into the fabric of our universe model by utilizing recursion in a way that&rsquo;s consistent, self-contained, and aligned with our objectives for exploration of emergent phenomena.<br>
</p>

<p>
We could introduce the idea that causes and effects are not determined by definitive states, but <i>probabilities</i> all the way down. Then, an effect could &ldquo;exists in the future&rdquo; as a probability, until they are evaluated/reduced by the &rsquo;present&rsquo; and therefore determined from there on, as they vanish deeper into the past forever and ever and ever. Does that make any sense? Yes? No? <i>Probably?</i><br>
</p>

<p>
Circular causation is the rule rather than an exception. Causation is prior to time, retro-causality is uneccessary.<br>
</p>
</div>
</div>
