blog/artificial-universe-metaphysics.project.html

<div id="outline-container-orgc0a6201" class="outline-4">
<h4 id="orgc0a6201"><a href="#orgc0a6201">Space</a></h4>
<div class="outline-text-4" id="text-orgc0a6201">
<p>
It happened that I couldn&rsquo;t find any compelling reason to introduce any notion of &ldquo;space&rdquo; into the Protoverse model itself. Why?<br>
</p>

<p>
Well, until I relized that my intention to implement the Protoverse as a computational universe, I disciplined myself to ignore the host system (distributed computers) entirely, in order to avoid getting caught up in implementation details too early. Turns out, I couldn&rsquo;t find the reason to introduce space, because space was already there — but in the computers: the data structures and ultimately, memory.<br>
</p>

<p>
This sounds kinda silly (because it is). And wouldn&rsquo;t it be too simplistic to think that space, in our universe, is just a data structure, or memory model? I mean the analogy seem way too naive and biased: &rsquo;entropy&rsquo; corresponds to empty/unwritten, &rsquo;order&rsquo; means the state of written information, 2nd law of thermodynamics implements forgetting/pruning — or could it be that space is more than just a data structure? Maybe the <i>complete substrate</i> for computation?<br>
</p>

<p>
Let&rsquo;s assume that the naive analogy holds — how could I make sure that this idea of space will emerge from the Protoverse itself, becoming an emergent phenomenon, not a lame pre-defined &ldquo;fundamental&rdquo;? How can the processes, in themselves, give rise to the structure in which they operate?<br>
</p>

<p>
Like in cellular automata, we find that the substrate (grid) isn&rsquo;t a pre-defined &ldquo;stage&rdquo; or &ldquo;space&rdquo; for the automaton, but part of its very definition: Each cell&rsquo;s state at a given timestep is determined by the states of its neighbouring cells at the previous timestep, making the structure of the grid inherently linked to the operation of the automaton. (If you play around with a cellular automata in an app, the grid only seems to be a pre-defined stage, because it is usually limited to 100 * 100 cells or so, so that it fits the app window.)<br>
</p>

<p>
It might be possible to allow the Protoverse to define its own &ldquo;topology&rdquo; of interactions, like in cellular automata where the rules of interaction define the grid, the Protoverse could involve processes that define which other processes they can interact with, and how. This would create an &ldquo;interaction space&rdquo;. And via iteration, a larger scale structure would emerge, which could be perceived as &ldquo;space&rdquo;.<br>
</p>

<p>
So in case I would not want to rely purely on the host and make it&rsquo;s memory available for processes to perceive and make sense of (which is the smarter idea), I will have to focus on defining rules for interactions that can create structure, and allow &ldquo;space&rdquo; to emerge from those dynamics.<br>
</p>
</div>
</div>



<div id="outline-container-org83da5e5" class="outline-4">
<h4 id="org83da5e5"><a href="#org83da5e5">Bootstrapping</a></h4>
<div class="outline-text-4" id="text-org83da5e5">
<p>
<i>[INCOMPLETE]</i><br>
</p>

<p>
Self-organization; emergence of high-level coherent behavior from low-level interactions<br>
</p>

<p>
Self-organization relies on four basic ingredients:<br>
</p>

<ol class="org-ol">
<li>strong dynamical non-linearity, often (though not necessarily) involving positive and negative feedback<br></li>
<li>balance of exploitation and exploration<br></li>
<li>multiple interactions among components<br></li>
<li>availability of energy (to overcome the natural tendency toward entropy, or loss of free energy)<br></li>
</ol>

<p>
any deterministic dynamic system automatically evolves towards a state of equilibrium that can be described in terms of an attractor in a basin of surrounding states. Once there, the further evolution of the system is constrained to remain in the attractor. This constraint implies a form of mutual dependency or coordination between its constituent components or subsystems. In Ashby&rsquo;s terms, each subsystem has adapted to the environment formed by all other subsystems.<br>
</p>

<p>
self-organization is facilitated by random perturbations (&ldquo;noise&rdquo;) that let the system explore a variety of states in its state space. This increases the chance that the system will arrive into the basin of a &ldquo;strong&rdquo; or &ldquo;deep&rdquo; attractor, from which it then quickly enters the attractor itself.<br>
</p>

<p>
the second law of thermodynamics in the 19th century. It states that total entropy, sometimes understood as disorder, will always increase over time in an isolated system. This means that a system cannot spontaneously increase its order without an external relationship that decreases order elsewhere in the system<br>
</p>

<p>
Around 2008–2009, a concept of guided self-organization started to take shape. This approach aims to regulate self-organization for specific purposes, so that a dynamical system may reach specific attractors or outcomes. The regulation constrains a self-organizing process within a complex system by restricting local interactions between the system components, rather than following an explicit control mechanism or a global design blueprint. The desired outcomes, such as increases in the resultant internal structure and/or functionality, are achieved by combining task-independent global objectives with task-dependent constraints on local interactions.<br>
</p>
</div>
</div>
</div>
</div>
