blog/artificial-universe-metaphysics.project.org
* What are Processes?

It seems commonly accepted to say that there could be many patterns in our universe that certain "observers" might recognize that others might not — due to their evolutionary, cultural, cognitive or technological limitations, advancements or perspectives.

A [[https://www.youtube.com/watch?v=jlqqZZ7q4-s][vine]] certainly may not experience reality like a [[https://www.youtube.com/watch?v=Qv-ETrzgOj8][gecko]] does. There are countless examples that suggest our perception and understanding of reality must be subjective too, depending on the patterns we're able to observe, describe and make sense of.

There are various conventions what 'observer' means, leading to much confusion. We tend to understand 'observer' as part of the duality (observer/observed), an abstract "measuring device", sometimes presume an absolute perspective, a passive role, and sometimes even a conscious entity. I used the term 'observer' out of habit when I began to throw together the first vague ideas.

Consider a uttterly boring example that is compatible with classical, relativistic and quantum physics. /An entity that registers change and feeds some sort of impulse back into the system as a result/ is such a well acknowledged, basic yet powerful representation of stuff /happening/:

#+begin_quote
A ball, acted upon by gravity, converts potential energy into kinetic energy as it falls.
Upon impact with the surface, the kinetic energy of the ball is partially transferred to the surface, and to the ball itself, in the form of deformation and generation of sound and heat.
The surface, through this interaction, absorbs some of this energy, causing its particles to vibrate more rapidly, which is perceived as an increase in temperature. Both the ball and the surface experience entropy increase as energy is redistributed into less ordered forms such as heat. The entire system moves toward thermodynamic equilibrium as a result of the energy transfer resulting from the collision.
#+end_quote

If we speak of /happening/ rather than /being/, we shift the perspective from "things" to "processes". Processes are /immaterial/ -- spread out "over time", not neatly encapsulated within definitive boundaries how humans like it; and Processes even change ([[https://en.wikipedia.org/wiki/Ship_of_Theseus][Ship of Theseus]]). I guess that's why Processes haven't received nearly as much love as they should. Well -- even matter turned out immaterial -- so it's not that much of a toad to swallow when I suggest that /all things/ are just temporary conglomerates of Processes.

"Building blocks" can't build anything. When I shifted my thinking from "things" to Processes, I realized that Processes can /do/ a lot of things; things can't -- because Processes are /subjects/ rather than /objects/. The implications of this notion are particularly striking when we consider the scales outside of the "living".

Processes interact, establish feedback loops and constitute all kinds of systems, from extremely simple to extremely complex. Like Darwin already demonstrated: for such complex systems as 'life' to arrive, there's no need for teleological agency or "mind"; and based on the 'Process' abstraction, the entire spectrum of complexity can be modeled.

Hence, Processes incorporate all requirements to be regarded as /observers/ naturally; observers arise on a spectrum, and they are pervasive. Of course all kinds of systems are "observer-dependent" -- how could they not, recognizing that they are entirely made from 'observers' in the first place?

At this point we have merged 'observers' into /Processes/, which we will use as the prime abstraction within the Protoverse. So usually I will not mention 'observers', but just refer to 'Processes'.

