blog/artificial-universe-metaphysics.project.html


<div id="outline-container-orgb54af1a" class="outline-2">
<h2 id="orgb54af1a"><a href="#orgb54af1a">What are Processes?</a></h2>
<div class="outline-text-2" id="text-orgb54af1a">
<p>
It seems commonly accepted to say that there could be many patterns in our universe that certain &ldquo;observers&rdquo; might recognize that others might not — due to their evolutionary, cultural, cognitive or technological limitations, advancements or perspectives.<br>
</p>

<p>
A <a href="https://www.youtube.com/watch?v=jlqqZZ7q4-s">vine</a> certainly may not experience reality like a <a href="https://www.youtube.com/watch?v=Qv-ETrzgOj8">gecko</a> does. There are countless examples that suggest our perception and understanding of reality must be subjective too, depending on the patterns we&rsquo;re able to observe, describe and make sense of.<br>
</p>

<p>
There are various conventions what &rsquo;observer&rsquo; means, leading to much confusion. We tend to understand &rsquo;observer&rsquo; as part of the duality (observer/observed), an abstract &ldquo;measuring device&rdquo;, sometimes presume an absolute perspective, a passive role, and sometimes even a conscious entity. I used the term &rsquo;observer&rsquo; out of habit when I began to throw together the first vague ideas.<br>
</p>

<p>
Consider a uttterly boring example that is compatible with classical, relativistic and quantum physics. <i>An entity that registers change and feeds some sort of impulse back into the system as a result</i> is such a well acknowledged, basic yet powerful representation of stuff <i>happening</i>:<br>
</p>

<blockquote>
<p>
A ball, acted upon by gravity, converts potential energy into kinetic energy as it falls.<br>
Upon impact with the surface, the kinetic energy of the ball is partially transferred to the surface, and to the ball itself, in the form of deformation and generation of sound and heat.<br>
The surface, through this interaction, absorbs some of this energy, causing its particles to vibrate more rapidly, which is perceived as an increase in temperature. Both the ball and the surface experience entropy increase as energy is redistributed into less ordered forms such as heat. The entire system moves toward thermodynamic equilibrium as a result of the energy transfer resulting from the collision.<br>
</p>
</blockquote>

<p>
If we speak of <i>happening</i> rather than <i>being</i>, we shift the perspective from &ldquo;things&rdquo; to &ldquo;processes&rdquo;. Processes are <i>immaterial</i> &#x2013; spread out &ldquo;over time&rdquo;, not neatly encapsulated within definitive boundaries how humans like it; and Processes even change (<a href="https://en.wikipedia.org/wiki/Ship_of_Theseus">Ship of Theseus</a>). I guess that&rsquo;s why Processes haven&rsquo;t received nearly as much love as they should. Well &#x2013; even matter turned out immaterial &#x2013; so it&rsquo;s not that much of a toad to swallow when I suggest that <i>all things</i> are just temporary conglomerates of Processes.<br>
</p>

<p>
&ldquo;Building blocks&rdquo; can&rsquo;t build anything. When I shifted my thinking from &ldquo;things&rdquo; to Processes, I realized that Processes can <i>do</i> a lot of things; things can&rsquo;t &#x2013; because Processes are <i>subjects</i> rather than <i>objects</i>. The implications of this notion are particularly striking when we consider the scales outside of the &ldquo;living&rdquo;.<br>
</p>

<p>
Processes interact, establish feedback loops and constitute all kinds of systems, from extremely simple to extremely complex. Like Darwin already demonstrated: for such complex systems as &rsquo;life&rsquo; to arrive, there&rsquo;s no need for teleological agency or &ldquo;mind&rdquo;; and based on the &rsquo;Process&rsquo; abstraction, the entire spectrum of complexity can be modeled.<br>
</p>

<p>
Hence, Processes incorporate all requirements to be regarded as <i>observers</i> naturally; observers arise on a spectrum, and they are pervasive. Of course all kinds of systems are &ldquo;observer-dependent&rdquo; &#x2013; how could they not, recognizing that they are entirely made from &rsquo;observers&rsquo; in the first place?<br>
</p>

<p>
At this point we have merged &rsquo;observers&rsquo; into <i>Processes</i>, which we will use as the prime abstraction within the Protoverse. So usually I will not mention &rsquo;observers&rsquo;, but just refer to &rsquo;Processes&rsquo;.<br>
</p>
</div>
