blog/artificial-universe-metaphysics.project.org
** Process as the Primary Abstraction

Processes are prior: they do not exist /within/ an environment of space and time, but they continuously /become/ their environment, actively creating the substrate they are operating in -- analogous to cells in cellular automata, where the grid is not a pre-defined "space", but each cell's state at a given step is determined by the states of its neighbouring cells at the previous step, so that the structure of the grid is inherently linked to the operation of the automaton (see also: [[https://en.wikipedia.org/wiki/Background_independence][Background independence]]).

There are two ideas how Process could organize:

  - *Primitive/higher-order style:* The term 'Process' can refer to one single /primitive/ Process; but it can also mean a conglomerate of Processes, which can be described as one /higher-order/ Process. Both perspectives are equally valid when referring to different levels of complexity or different emergent phenomena. There's no upper limit to higher orders, but a lower end. Higher-order Processes are no "entities" or "actors", but emergent complex systems without fixed boundaries. This is quite like cells and patterns in cellular automata, as there's also a lower end, the "primitive" (single) cell. I consider this as a pragmatic variant.

  - *Fractal style:* Processes do not consist of primitive Processes at the lowest level, but recursively of further processes. This would be a dynamic, fractal-like structure where every process could be further divisible or analyzable into subprocesses ad infinitum. I consider that variant as quite elegant, since it would be one underlying principle from which all complexity emerges -- and who doesn't like fractals?

I envision a process as a meta-framework that describes the interactions between processes. The rules or the framework within which the processes interact are not necessarily fixed but can evolve (well, that depends on either adhering to the primitive or fractal structure). Such a system would not only demonstrate recursion in terms of structure but also potentially recursive self-modification in terms of the interaction rules.

- Primitive Processes are loops like /recursive functions/, so they are naturally legitimate "places" to keep state, generally described as relations to other Processes. It would be a matter of design if accessing state requires a "distinct" counterpart Process (observer?) in order to read the state of a Process, or if a Process can access its change-record by itself, e.g. by recursively re-evaluating its state (I'm fond of the latter, and it's probably one and the same anyway, just in other terms).

- Each Process maintains a record of its Experiences, so that each Process has effectively its own "timeline". When there are Processes in the Protoverse interacting across nested scales of emergent complexity, higher-order processes would principally operate in temporal relativity.

- There are no absolute or inherent boundaries between higher-order Processes. Boundaries could be drawn (and I do so quite often handwavingly) dependent on the perspective of other interacting Processes, but by entirely relational criteria.

- Higher-order Processes may develop various degrees of interaction -- e.g. more effective, efficient or richer "implementations", which may deviate significantly from the interactions of primitive Processes in one or more ways. For example, they may interact via evolved, commonly shared protocols or languages built upon consensus. Nevertheless, compatibility between Processes of various n-orders is guaranteed by the capabilities of the primitive Processes.

- Is the process-relational ontology monistic or pluralistic? It's actually both. The monist aspect of Processes as "universal" abstraction ensures the compatibility required to interact across nested scales of complexity; these scales in turn represent the pluralist aspect, leading to open-endness by quasi-darwinian evolution and meta-evolution (more about that later).

