blog/artificial-universe-metaphysics.project.html

<div id="outline-container-orgd84d5db" class="outline-3">
<h3 id="orgd84d5db"><a href="#orgd84d5db">Process as the Primary Abstraction</a></h3>
<div class="outline-text-3" id="text-orgd84d5db">
<p>
Processes are prior: they do not exist <i>within</i> an environment of space and time, but they continuously <i>become</i> their environment, actively creating the substrate they are operating in &#x2013; analogous to cells in cellular automata, where the grid is not a pre-defined &ldquo;space&rdquo;, but each cell&rsquo;s state at a given step is determined by the states of its neighbouring cells at the previous step, so that the structure of the grid is inherently linked to the operation of the automaton (see also: <a href="https://en.wikipedia.org/wiki/Background_independence">Background independence</a>).<br>
</p>

<p>
There are two ideas how Process could organize:<br>
</p>

<ul class="org-ul">
<li><b>Primitive/higher-order style:</b> The term &rsquo;Process&rsquo; can refer to one single <i>primitive</i> Process; but it can also mean a conglomerate of Processes, which can be described as one <i>higher-order</i> Process. Both perspectives are equally valid when referring to different levels of complexity or different emergent phenomena. There&rsquo;s no upper limit to higher orders, but a lower end. Higher-order Processes are no &ldquo;entities&rdquo; or &ldquo;actors&rdquo;, but emergent complex systems without fixed boundaries. This is quite like cells and patterns in cellular automata, as there&rsquo;s also a lower end, the &ldquo;primitive&rdquo; (single) cell. I consider this as a pragmatic variant.<br></li>

<li><b>Fractal style:</b> Processes do not consist of primitive Processes at the lowest level, but recursively of further processes. This would be a dynamic, fractal-like structure where every process could be further divisible or analyzable into subprocesses ad infinitum. I consider that variant as quite elegant, since it would be one underlying principle from which all complexity emerges &#x2013; and who doesn&rsquo;t like fractals?<br></li>
</ul>

<p>
I envision a process as a meta-framework that describes the interactions between processes. The rules or the framework within which the processes interact are not necessarily fixed but can evolve (well, that depends on either adhering to the primitive or fractal structure). Such a system would not only demonstrate recursion in terms of structure but also potentially recursive self-modification in terms of the interaction rules.<br>
</p>

<ul class="org-ul">
<li>Primitive Processes are loops like <i>recursive functions</i>, so they are naturally legitimate &ldquo;places&rdquo; to keep state, generally described as relations to other Processes. It would be a matter of design if accessing state requires a &ldquo;distinct&rdquo; counterpart Process (observer?) in order to read the state of a Process, or if a Process can access its change-record by itself, e.g. by recursively re-evaluating its state (I&rsquo;m fond of the latter, and it&rsquo;s probably one and the same anyway, just in other terms).<br></li>

<li>Each Process maintains a record of its Experiences, so that each Process has effectively its own &ldquo;timeline&rdquo;. When there are Processes in the Protoverse interacting across nested scales of emergent complexity, higher-order processes would principally operate in temporal relativity.<br></li>

<li>There are no absolute or inherent boundaries between higher-order Processes. Boundaries could be drawn (and I do so quite often handwavingly) dependent on the perspective of other interacting Processes, but by entirely relational criteria.<br></li>

<li>Higher-order Processes may develop various degrees of interaction &#x2013; e.g. more effective, efficient or richer &ldquo;implementations&rdquo;, which may deviate significantly from the interactions of primitive Processes in one or more ways. For example, they may interact via evolved, commonly shared protocols or languages built upon consensus. Nevertheless, compatibility between Processes of various n-orders is guaranteed by the capabilities of the primitive Processes.<br></li>

<li>Is the process-relational ontology monistic or pluralistic? It&rsquo;s actually both. The monist aspect of Processes as &ldquo;universal&rdquo; abstraction ensures the compatibility required to interact across nested scales of complexity; these scales in turn represent the pluralist aspect, leading to open-endness by quasi-darwinian evolution and meta-evolution (more about that later).<br></li>
</ul>
</div>
</div>
