blog/artificial-universe-metaphysics.project.org
** From Subjective Experience to Shared Realities

It may come as a shock but I do not really distinguish between ontology (the study of what exists) and epistemology (the study of how we know what exists). Epistemological methods (how we come to know and validate information) are not just a means to an end (understanding an independent reality) but are fundamentally what constitutes reality itself.

Yet, I do not advocate a stance that goes like: "You know, I can't know it, therefore it doesn't matter, so I declare it does not exist." That's nihilism, and that's not the point. There isn't a sharp distinction, because:

"Knowledge", along with "the abstract" and "virtual", are not special half-existing twilight ghosts, but regular components of reality. Yes, usually we don't call them "real", but they are -- it's just a mix of messed up taxonomy resulting from choosing the wrong sorting criteria, imprecise language use, the convention that "matter" matters most ("A ball is something real I can touch! Electrons are tiny balls!") and ignorance (they are not, and you've never touched a ball).

The human longing for an absolutes and fundamentals (and ultimately, "reality"") might be a bias that can be attributed to various evolutionary and cognitive predispositions (see also Plato's [[https://en.wikipedia.org/wiki/Allegory_of_the_cave][Allegory of the Cave]]).

What's commonly understood as "knowledge" should be considered as /belief validated to a relatively satisfying degree of confidence/. Depending on the context, the threshold of 'satisfying degree' may be rooted in empirical evidence, logical consistency, consensus, faith, and most likely a combination of these and other methods. However, none of these methods are flawless in themselves, and more often than not rooted in ... well, "reality" that isn't really real, but a relational network of beliefs.

How can we then be sure about the "truth" about a certain proposition? Well, we can /believe to be sure/ within constraints of self-defined edifices of beliefs (quite like formal systems based on axioms). At first glance, such a system may seem self-contained (reinforced by the impression of coherence and consistency), but this system too is ultimately rooted outside of itself in some gradually (more or less) valid beliefs, whereby the the degree of validity may not be quantified, and even cannot be quantified in certain cases (see also [[https://en.wikipedia.org/wiki/Fallibilism][fallibilism]]).

However, the relational network of beliefs, not unlike a space station build from tubes and modules, provides "good enough" stability due to it's sheer mass, inertia and internal structure -- so that foundationalism, coherentism and infinitism are all legit docking protocols to attach further beliefs (their efficacy may depend on the kind of beliefs they're integrating), who extend the network and make it even more massive and inert. This implies that the network itself is made up from previously attached single-ended, circular and infinite substructures.

How could Processes could revise or update their belief networks? The role can be filled by quasi-darwinian evolution, that is when selective criteria by certain Processes get hold on other Processes (resp. their sub-Processes).

No system can establish its own consistency without reference to something external to itself -- this is an implication from Gödels incompleteness theorems (Gödel's incompleteness theorems are strictly proven within /formal systems of arithmetic/, and their direct extrapolation to broader epistemic systems is debated, because formal systems have particular and rigorously defined properties that do not necessarily map onto other systems).

But, according to empirical evidence, "closed systems" haven't been encountered in nature; it's unknown if the universe itself is a closed or open system. Further, for a system to count as a "closed system", it would have to be guaranteed to remain "closed" for all eternity.

** Process Scoping -- Access to Information

While all natural systems are generally open, we encounter various scoping models who determine what information can be accessed, under what circumstances and to what extend; there's also a plethora of /interfaces/ that determine interactions.

- Scope: In darwinian evolution, there are tendencies both to escalate the scope of access (ultimately interaction); e.g. resulting in improved resource acquisition, reproductive strategies, or environmental sensing -- as well as to limit it; e.g. reduced energy expenditure, avoiding predation, or preventing dilution of a successful gene pool.

- Interfaces: Natural systems also operate on various scales, from microscopic to cosmic, and interactions across scales are not only possible, but seem crucial for open-endedness. However, there are natural limits to these interactions. The concept of hierarchical organization is pertinent; it imposes structural constraints on how elements within one level interact with those at another. This arrangement can be seen in everything from the cellular organization within an organism to the ecological hierarchies.

*** Towards Evolving Scope

Processes in the Protoverse are not distinct from the reality they experience; instead, they're active participants creating and shaping it. The characteristics of experiencing reality may correlate with the intricacies of the immediate environment -- the predominantly relevant nested scales of complexity with which the Processes have co-evolved.

Which Patterns Processes may experience, how, and to make sense of them, will eventually depend on co-evolving factors -- described as analogues like a Process' "perspective", "zoom-factor" or "ability". Within the area of knowledge-aquisition, "scope" is a better term.

The possibility of gradual escalation of scope, as well as gradual restriction therefore seems important. @@comment:This can be /simulated/ in Common Lisp via /dynamic scope/, but I have no clue how this could be done in OCaml, which has only lexical scope -- but I guess it has something to do with modules (the usual suspect)@@

