blog/artificial-universe-metaphysics.project.html

<div id="outline-container-org1a9d076" class="outline-3">
<h3 id="org1a9d076"><a href="#org1a9d076">From Subjective Experience to Shared Realities</a></h3>
<div class="outline-text-3" id="text-org1a9d076">
<p>
It may come as a shock but I do not really distinguish between ontology (the study of what exists) and epistemology (the study of how we know what exists). Epistemological methods (how we come to know and validate information) are not just a means to an end (understanding an independent reality) but are fundamentally what constitutes reality itself.<br>
</p>

<p>
Yet, I do not advocate a stance that goes like: &ldquo;You know, I can&rsquo;t know it, therefore it doesn&rsquo;t matter, so I declare it does not exist.&rdquo; That&rsquo;s nihilism, and that&rsquo;s not the point. There isn&rsquo;t a sharp distinction, because:<br>
</p>

<p>
&ldquo;Knowledge&rdquo;, along with &ldquo;the abstract&rdquo; and &ldquo;virtual&rdquo;, are not special half-existing twilight ghosts, but regular components of reality. Yes, usually we don&rsquo;t call them &ldquo;real&rdquo;, but they are &#x2013; it&rsquo;s just a mix of messed up taxonomy resulting from choosing the wrong sorting criteria, imprecise language use, the convention that &ldquo;matter&rdquo; matters most (&ldquo;A ball is something real I can touch! Electrons are tiny balls!&rdquo;) and ignorance (they are not, and you&rsquo;ve never touched a ball).<br>
</p>

<p>
The human longing for an absolutes and fundamentals (and ultimately, &ldquo;reality&rdquo;&ldquo;) might be a bias that can be attributed to various evolutionary and cognitive predispositions (see also Plato&rsquo;s <a href="https://en.wikipedia.org/wiki/Allegory_of_the_cave">Allegory of the Cave</a>).<br>
</p>

<p>
What&rsquo;s commonly understood as &ldquo;knowledge&rdquo; should be considered as <i>belief validated to a relatively satisfying degree of confidence</i>. Depending on the context, the threshold of &rsquo;satisfying degree&rsquo; may be rooted in empirical evidence, logical consistency, consensus, faith, and most likely a combination of these and other methods. However, none of these methods are flawless in themselves, and more often than not rooted in &#x2026; well, &ldquo;reality&rdquo; that isn&rsquo;t really real, but a relational network of beliefs.<br>
</p>

<p>
How can we then be sure about the &ldquo;truth&rdquo; about a certain proposition? Well, we can <i>believe to be sure</i> within constraints of self-defined edifices of beliefs (quite like formal systems based on axioms). At first glance, such a system may seem self-contained (reinforced by the impression of coherence and consistency), but this system too is ultimately rooted outside of itself in some gradually (more or less) valid beliefs, whereby the the degree of validity may not be quantified, and even cannot be quantified in certain cases (see also <a href="https://en.wikipedia.org/wiki/Fallibilism">fallibilism</a>).<br>
</p>

<p>
However, the relational network of beliefs, not unlike a space station build from tubes and modules, provides &ldquo;good enough&rdquo; stability due to it&rsquo;s sheer mass, inertia and internal structure &#x2013; so that foundationalism, coherentism and infinitism are all legit docking protocols to attach further beliefs (their efficacy may depend on the kind of beliefs they&rsquo;re integrating), who extend the network and make it even more massive and inert. This implies that the network itself is made up from previously attached single-ended, circular and infinite substructures.<br>
</p>

<p>
How could Processes could revise or update their belief networks? The role can be filled by quasi-darwinian evolution, that is when selective criteria by certain Processes get hold on other Processes (resp. their sub-Processes).<br>
</p>

<p>
No system can establish its own consistency without reference to something external to itself &#x2013; this is an implication from Gödels incompleteness theorems (Gödel&rsquo;s incompleteness theorems are strictly proven within <i>formal systems of arithmetic</i>, and their direct extrapolation to broader epistemic systems is debated, because formal systems have particular and rigorously defined properties that do not necessarily map onto other systems).<br>
</p>

<p>
But, according to empirical evidence, &ldquo;closed systems&rdquo; haven&rsquo;t been encountered in nature; it&rsquo;s unknown if the universe itself is a closed or open system. Further, for a system to count as a &ldquo;closed system&rdquo;, it would have to be guaranteed to remain &ldquo;closed&rdquo; for all eternity.<br>
</p>
</div>
</div>

<div id="outline-container-orgf976ef6" class="outline-3">
<h3 id="orgf976ef6"><a href="#orgf976ef6">Process Scoping &#x2013; Access to Information</a></h3>
<div class="outline-text-3" id="text-orgf976ef6">
<p>
While all natural systems are generally open, we encounter various scoping models who determine what information can be accessed, under what circumstances and to what extend; there&rsquo;s also a plethora of <i>interfaces</i> that determine interactions.<br>
</p>

<ul class="org-ul">
<li>Scope: In darwinian evolution, there are tendencies both to escalate the scope of access (ultimately interaction); e.g. resulting in improved resource acquisition, reproductive strategies, or environmental sensing &#x2013; as well as to limit it; e.g. reduced energy expenditure, avoiding predation, or preventing dilution of a successful gene pool.<br></li>

<li>Interfaces: Natural systems also operate on various scales, from microscopic to cosmic, and interactions across scales are not only possible, but seem crucial for open-endedness. However, there are natural limits to these interactions. The concept of hierarchical organization is pertinent; it imposes structural constraints on how elements within one level interact with those at another. This arrangement can be seen in everything from the cellular organization within an organism to the ecological hierarchies.<br></li>
</ul>
</div>

<div id="outline-container-org7ba2592" class="outline-4">
<h4 id="org7ba2592"><a href="#org7ba2592">Towards Evolving Scope</a></h4>
<div class="outline-text-4" id="text-org7ba2592">
<p>
Processes in the Protoverse are not distinct from the reality they experience; instead, they&rsquo;re active participants creating and shaping it. The characteristics of experiencing reality may correlate with the intricacies of the immediate environment &#x2013; the predominantly relevant nested scales of complexity with which the Processes have co-evolved.<br>
</p>

<p>
Which Patterns Processes may experience, how, and to make sense of them, will eventually depend on co-evolving factors &#x2013; described as analogues like a Process&rsquo; &ldquo;perspective&rdquo;, &ldquo;zoom-factor&rdquo; or &ldquo;ability&rdquo;. Within the area of knowledge-aquisition, &ldquo;scope&rdquo; is a better term.<br>
</p>

<p>
The possibility of gradual escalation of scope, as well as gradual restriction therefore seems important. <br>
</p>
</div>
</div>
