blog/artificial-universe-metaphysics.project.org
*** How can Processes Account for Shared Realities?

Well, can /we/? And with whom, exactly? What's your shared reality with a Thiobacillus — "Sulphur is yummy"?

Humans share their subjective realities only with a narrow class of species, with which they /can relate to/; to the highest degree normally with other humans. If we wander off the trampled path just a little and consider other species, the degrees of shared reality are rapidly dwindling.

How can Processes agree upon beliefs or even construct knowledge?

It might turn out beneficial for certain processes to reach "common ground" by re-evaluating between agreement and disagreement. Hence, /striving for consensus might be one of the drivers for Evolution ("selective pressure") within the Protoverse/, as a common ground might turn out to be beneficial in multiple ways.

Reality, as we humans experience it, is neither socially constructed, fundamentally physical, restricted to "matter", nor does it exists only in the mind -- it's all of that together and more, and it's dynamic on top of that. Boundaries are not fixed but relational, and "all is connected" in so far that process-relational ontology (thanks to its "monistic pluralism") can model the /required compatibility across scales of complexity/.

So, /everything/ can be /real/, possible (probablistic) and true, but within specific relational context. Even the concept of an 'object' is fine, just not at every scale: The crux is that not all offsprings of higher-level consensual realities (which includes formal systems and logics) can be readily applied on every other scale, because that /could/ (not 'must'!) result in ignoring their contextual/relational "roots", so that their validity looses hold.

Such violations (e.g. inappropriate abstractions -- like the concepts of 'object' or 'particle' applied pervasively) are often hard to detect because their validity /depends/ on many sources. "Roots" is a not-so-bad word to put it, instead of "foundation" -- because it gives us the more accurate picture of multiple anchors in many directions, rather than a single flat lump of concrete serving as the source(s) of validity.

Systems of Processes and their relations across a span of certain scales /can be discovered/ by others, even though the overall model is primary constructivist. 'Objectivity' depends on the relationships and interactions between processes, rather than being a universal viewpoint removed from all perspective. Here are different aspects:

  1. Inter-Subjectivity: The classical notion of objectivity is replaced with a more nuanced concept of inter-subjectivity. 'Subjectivity' refers to the 'experience' or 'perspective' of a given Process, while 'inter-subjectivity' refers to the shared aspects of reality that emerge from the interactions between multiple Processes.

  2. Relational Objectivity: The seeming consistency and coherence of Patterns across different perspectives might manifest in threshold-delimited spectra arising from approximation (or discretization) due to the inherent lack of absolute equality, so that a relational objective fact maintains its structure or function across various Process interactions (observational invariants).

  3. Emergent Objectivity: Arising from the confluence of Processes, objectivity is a reflection of robust Patterns. These patterns can be seen as objective to the extent that they are stable within the context of the system's evolutionary dynamics. This is strongly related to "universals" and consensual reality.

  4. Evolutionary Objectivity: From an evolutionary perspective, certain Patterns or may be 'selected' for their resilience or adaptiveness within the system, thereby achieving a kind of evolutionary objectivity. These features are objective insofar as they consistently contribute to the loop of evolutionary processes.

  5. Contextual Objectivity: The idea of "contextual objectivity" asserts that what is considered objective is not divorced from context but is relative to the shared experiences and relations within particular process ensembles or communities.

Systems of interrelated Processes can re-constructed ("cloned") by the means of other scales to a certain degree (just not to their full extend, not "perfectly", ultimately for the reason that there cannot be two things absolutely equal). Re-constructing of a system of processes gives naturally rise to a new nested scale of complexity -- it's like if we develop and describe a model of something we've discovered in nature.

Such a new scale in turn becomes a fully legit part of reality, independent of (our made-up) "classic" categorizations such as "abstract" or "concrete", because these categories don't apply per se.

*** The "Abstract" vs. "Concrete" Dichotomy

Many dichotomies and categorizations commonly tied to substance ontologies don't apply for process philosophy. Here are some not-so-obvious departures from classical views:

| Classical categories | Protoverse                                             |
|----------------------+--------------------------------------------------------|
| Subject/Object       | Only subjects (Processes)                              |
| Mind/Matter          | Evolving inter-related complex systems, no privileges  |
| Monist/Dualist       | Monist pluralism                                       |
| Abstract/Concrete    | No signifiance                                         |

- *Abstract:* What's broadly considered as 'abstract' could be viewed as "algorithmic" -- relational structures between primitive (and within higher-order) Processes that exhibit a declarative aspect.

- *Concrete:* Processes are like acts of 'running algorithms' that create systems of further interrelated Processes -- that in turn could be considered as 'concrete'.

But I rather forced both descriptions. The point is that both "abstract" and "concrete" aspects are inseparable and occur in such a tangled interplay at evolving, nested and inter-related scales. There are not really definite boundaries. Overall, trying to apply this dichotomy wouldn't contribute to better understanding.

This is also quite different to Alfred North Whitehead's process ontology, who reserved a special category "eternal objects". I'm actually very happy that we don't have to figure out a "special place" for "the abstract"; "WTF is this abstract!?" was a major pain point for me at earlier stages.

