blog/artificial-universe-metaphysics.project.html

<div id="outline-container-orgf73aca9" class="outline-4">
<h4 id="orgf73aca9"><a href="#orgf73aca9">How can Processes Account for Shared Realities?</a></h4>
<div class="outline-text-4" id="text-orgf73aca9">
<p>
Well, can <i>we</i>? And with whom, exactly? What&rsquo;s your shared reality with a Thiobacillus — &ldquo;Sulphur is yummy&rdquo;?<br>
</p>

<p>
Humans share their subjective realities only with a narrow class of species, with which they <i>can relate to</i>; to the highest degree normally with other humans. If we wander off the trampled path just a little and consider other species, the degrees of shared reality are rapidly dwindling.<br>
</p>

<p>
How can Processes agree upon beliefs or even construct knowledge?<br>
</p>

<p>
It might turn out beneficial for certain processes to reach &ldquo;common ground&rdquo; by re-evaluating between agreement and disagreement. Hence, <i>striving for consensus might be one of the drivers for Evolution (&ldquo;selective pressure&rdquo;) within the Protoverse</i>, as a common ground might turn out to be beneficial in multiple ways.<br>
</p>

<p>
Reality, as we humans experience it, is neither socially constructed, fundamentally physical, restricted to &ldquo;matter&rdquo;, nor does it exists only in the mind &#x2013; it&rsquo;s all of that together and more, and it&rsquo;s dynamic on top of that. Boundaries are not fixed but relational, and &ldquo;all is connected&rdquo; in so far that process-relational ontology (thanks to its &ldquo;monistic pluralism&rdquo;) can model the <i>required compatibility across scales of complexity</i>.<br>
</p>

<p>
So, <i>everything</i> can be <i>real</i>, possible (probablistic) and true, but within specific relational context. Even the concept of an &rsquo;object&rsquo; is fine, just not at every scale: The crux is that not all offsprings of higher-level consensual realities (which includes formal systems and logics) can be readily applied on every other scale, because that <i>could</i> (not &rsquo;must&rsquo;!) result in ignoring their contextual/relational &ldquo;roots&rdquo;, so that their validity looses hold.<br>
</p>

<p>
Such violations (e.g. inappropriate abstractions &#x2013; like the concepts of &rsquo;object&rsquo; or &rsquo;particle&rsquo; applied pervasively) are often hard to detect because their validity <i>depends</i> on many sources. &ldquo;Roots&rdquo; is a not-so-bad word to put it, instead of &ldquo;foundation&rdquo; &#x2013; because it gives us the more accurate picture of multiple anchors in many directions, rather than a single flat lump of concrete serving as the source(s) of validity.<br>
</p>

<p>
Systems of Processes and their relations across a span of certain scales <i>can be discovered</i> by others, even though the overall model is primary constructivist. &rsquo;Objectivity&rsquo; depends on the relationships and interactions between processes, rather than being a universal viewpoint removed from all perspective. Here are different aspects:<br>
</p>

<ol class="org-ol">
<li>Inter-Subjectivity: The classical notion of objectivity is replaced with a more nuanced concept of inter-subjectivity. &rsquo;Subjectivity&rsquo; refers to the &rsquo;experience&rsquo; or &rsquo;perspective&rsquo; of a given Process, while &rsquo;inter-subjectivity&rsquo; refers to the shared aspects of reality that emerge from the interactions between multiple Processes.<br></li>

<li>Relational Objectivity: The seeming consistency and coherence of Patterns across different perspectives might manifest in threshold-delimited spectra arising from approximation (or discretization) due to the inherent lack of absolute equality, so that a relational objective fact maintains its structure or function across various Process interactions (observational invariants).<br></li>

<li>Emergent Objectivity: Arising from the confluence of Processes, objectivity is a reflection of robust Patterns. These patterns can be seen as objective to the extent that they are stable within the context of the system&rsquo;s evolutionary dynamics. This is strongly related to &ldquo;universals&rdquo; and consensual reality.<br></li>

<li>Evolutionary Objectivity: From an evolutionary perspective, certain Patterns or may be &rsquo;selected&rsquo; for their resilience or adaptiveness within the system, thereby achieving a kind of evolutionary objectivity. These features are objective insofar as they consistently contribute to the loop of evolutionary processes.<br></li>

<li>Contextual Objectivity: The idea of &ldquo;contextual objectivity&rdquo; asserts that what is considered objective is not divorced from context but is relative to the shared experiences and relations within particular process ensembles or communities.<br></li>
</ol>

<p>
Systems of interrelated Processes can re-constructed (&ldquo;cloned&rdquo;) by the means of other scales to a certain degree (just not to their full extend, not &ldquo;perfectly&rdquo;, ultimately for the reason that there cannot be two things absolutely equal). Re-constructing of a system of processes gives naturally rise to a new nested scale of complexity &#x2013; it&rsquo;s like if we develop and describe a model of something we&rsquo;ve discovered in nature.<br>
</p>

<p>
Such a new scale in turn becomes a fully legit part of reality, independent of (our made-up) &ldquo;classic&rdquo; categorizations such as &ldquo;abstract&rdquo; or &ldquo;concrete&rdquo;, because these categories don&rsquo;t apply per se.<br>
</p>
</div>
</div>

<div id="outline-container-org86d6d81" class="outline-4">
<h4 id="org86d6d81"><a href="#org86d6d81">The &ldquo;Abstract&rdquo; vs. &ldquo;Concrete&rdquo; Dichotomy</a></h4>
<div class="outline-text-4" id="text-org86d6d81">
<p>
Many dichotomies and categorizations commonly tied to substance ontologies don&rsquo;t apply for process philosophy. Here are some not-so-obvious departures from classical views:<br>
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Classical categories</th>
<th scope="col" class="org-left">Protoverse</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Subject/Object</td>
<td class="org-left">Only subjects (Processes)</td>
</tr>

<tr>
<td class="org-left">Mind/Matter</td>
<td class="org-left">Evolving inter-related complex systems, no privileges</td>
</tr>

<tr>
<td class="org-left">Monist/Dualist</td>
<td class="org-left">Monist pluralism</td>
</tr>

<tr>
<td class="org-left">Abstract/Concrete</td>
<td class="org-left">No signifiance</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><b>Abstract:</b> What&rsquo;s broadly considered as &rsquo;abstract&rsquo; could be viewed as &ldquo;algorithmic&rdquo; &#x2013; relational structures between primitive (and within higher-order) Processes that exhibit a declarative aspect.<br></li>

<li><b>Concrete:</b> Processes are like acts of &rsquo;running algorithms&rsquo; that create systems of further interrelated Processes &#x2013; that in turn could be considered as &rsquo;concrete&rsquo;.<br></li>
</ul>

<p>
But I rather forced both descriptions. The point is that both &ldquo;abstract&rdquo; and &ldquo;concrete&rdquo; aspects are inseparable and occur in such a tangled interplay at evolving, nested and inter-related scales. There are not really definite boundaries. Overall, trying to apply this dichotomy wouldn&rsquo;t contribute to better understanding.<br>
</p>

<p>
This is also quite different to Alfred North Whitehead&rsquo;s process ontology, who reserved a special category &ldquo;eternal objects&rdquo;. I&rsquo;m actually very happy that we don&rsquo;t have to figure out a &ldquo;special place&rdquo; for &ldquo;the abstract&rdquo;; &ldquo;WTF is this abstract!?&rdquo; was a major pain point for me at earlier stages.<br>
</p>
</div>
</div>
