blog/artificial-universe-metaphysics.project.org
*** The Problem of Universals

The traditional philosophical "[[https://en.wikipedia.org/wiki/Problem_of_universals][Problem of universals]]" concerns the nature of properties, classes, or relations that different "particular" things can all share in common: /Are these universals real entities that exist independently of particular instances, or are they simply names we give to common features we observe?/

Within this framework, universals would be expected to emerge convergently from the interactions and recurrent behaviors by interacting Processes. "Universals" are not static entities that exist in an abstract scale apart from "concrete instances", nor are they mere linguistic constructs.

Within this framework, the "Problem of universals" transcends its historical status as an ontological dilemma, because the appearance of "universals" could be an indicator of shared reality amongst Processes; although there's no clear method for identification and measurement as of now -- likely something along the lines of "repeated appearance of universal patterns that carry specific semantic payloads in losely related contexts".

*** Conceptual Pluralism

Let's acknowledge the fact that there can be several different, but nevertheless entirely valid descriptions to construct anything. Does the "essence", "abstract idea" or whatever spirit dwell in the commonality distilled from all possible, valid descriptions?

"Intrinsic properties" to the rescue"? What about hierarchies of properties and declaring some as more special and more important than others? Well, all of that turns out to circle back so that we arrive at the beginning, looking at one descriptions, which happens to be just one amongst all the others.

Can we unify multiple descriptions into one ultimate description? How?

We can try to find a "translation" from one description to another description. The point is -- there wouldn't be just one single ultimate translation between all the descriptions (what would count as "essence"), but there would be many, and there could be more than one translation between two single descriptions, and maybe there are descriptions we can't find any translation for.

But couldn't we merge these translations into one? What if we put the descriptions aside, and instead pick only the /tranlations/ between them, and then figure out translations between the original translations? Oh, and what if we play this game over and over again -- will we eventually arrive at the ultimate essence of 'triangle'?

What we would likely end up with, may be extremely generalized principles that describe not just 'triangle', but dissolve into a network of relations and transformations that apply across many mathematical structures, quite the contrary of distilling an 'essence' of 'triangleness' -- but maybe that's exactly the point: It not just offers an escape from the "essences" drag, but reminds that meaning arises not from isolated "things in themselves" or "inherent properties", but from relational context.

* Interacting Processes

The primary concept of interaction between processes is the /Experience/. It seems like a suitable term for low-level as well as higher-level interactions. What does a Process experience? Patterns produced by other Processes, because there isn't anything other than Processes (no backdrop or stage-like "environment" -- Processes continuously /become/ (co-evolve) their environment).

You can understand Patterns as the raw data of Experience -- the unrealized potentials, raw data as 'not-yet-made-sense-of'. Patterns are not to be understood as static or dynamic, as this distinction would imply assumptions that are not justified if we look at Patterns in isolation.

Consequently, the counterpart Processes are also sharing that Experience. There's nothing to Experience without change; and likewise, change can't happen without (causing) an Experience somewhere: everything that happens, always has /some influence/ on another Process, even if this impact is so subtle that it is virtually imperceptible. Nothing exists in isolation. How Processes handle Experience, is another story.

Just recently I stumbled upon /π-calculus/. Process calculi are models of computation. Right now my understanding is that designing the Protoverse Process interactions might be basically the same as designing a /process calculus/. I had no chance to look into π-calculus yet, but maybe I could later reconcile ideas in order to refine Process interactions.

