blog/artificial-universe-metaphysics.project.html

<div id="outline-container-orgeb8f46c" class="outline-4">
<h4 id="orgeb8f46c"><a href="#orgeb8f46c">The Problem of Universals</a></h4>
<div class="outline-text-4" id="text-orgeb8f46c">
<p>
The traditional philosophical &ldquo;<a href="https://en.wikipedia.org/wiki/Problem_of_universals">Problem of universals</a>&rdquo; concerns the nature of properties, classes, or relations that different &ldquo;particular&rdquo; things can all share in common: <i>Are these universals real entities that exist independently of particular instances, or are they simply names we give to common features we observe?</i><br>
</p>

<p>
Within this framework, universals would be expected to emerge convergently from the interactions and recurrent behaviors by interacting Processes. &ldquo;Universals&rdquo; are not static entities that exist in an abstract scale apart from &ldquo;concrete instances&rdquo;, nor are they mere linguistic constructs.<br>
</p>

<p>
Within this framework, the &ldquo;Problem of universals&rdquo; transcends its historical status as an ontological dilemma, because the appearance of &ldquo;universals&rdquo; could be an indicator of shared reality amongst Processes; although there&rsquo;s no clear method for identification and measurement as of now &#x2013; likely something along the lines of &ldquo;repeated appearance of universal patterns that carry specific semantic payloads in losely related contexts&rdquo;.<br>
</p>
</div>
</div>

<div id="outline-container-orged9f95c" class="outline-4">
<h4 id="orged9f95c"><a href="#orged9f95c">Conceptual Pluralism</a></h4>
<div class="outline-text-4" id="text-orged9f95c">
<p>
Let&rsquo;s acknowledge the fact that there can be several different, but nevertheless entirely valid descriptions to construct anything. Does the &ldquo;essence&rdquo;, &ldquo;abstract idea&rdquo; or whatever spirit dwell in the commonality distilled from all possible, valid descriptions?<br>
</p>

<p>
&ldquo;Intrinsic properties&rdquo; to the rescue&ldquo;? What about hierarchies of properties and declaring some as more special and more important than others? Well, all of that turns out to circle back so that we arrive at the beginning, looking at one descriptions, which happens to be just one amongst all the others.<br>
</p>

<p>
Can we unify multiple descriptions into one ultimate description? How?<br>
</p>

<p>
We can try to find a &ldquo;translation&rdquo; from one description to another description. The point is &#x2013; there wouldn&rsquo;t be just one single ultimate translation between all the descriptions (what would count as &ldquo;essence&rdquo;), but there would be many, and there could be more than one translation between two single descriptions, and maybe there are descriptions we can&rsquo;t find any translation for.<br>
</p>

<p>
But couldn&rsquo;t we merge these translations into one? What if we put the descriptions aside, and instead pick only the <i>tranlations</i> between them, and then figure out translations between the original translations? Oh, and what if we play this game over and over again &#x2013; will we eventually arrive at the ultimate essence of &rsquo;triangle&rsquo;?<br>
</p>

<p>
What we would likely end up with, may be extremely generalized principles that describe not just &rsquo;triangle&rsquo;, but dissolve into a network of relations and transformations that apply across many mathematical structures, quite the contrary of distilling an &rsquo;essence&rsquo; of &rsquo;triangleness&rsquo; &#x2013; but maybe that&rsquo;s exactly the point: It not just offers an escape from the &ldquo;essences&rdquo; drag, but reminds that meaning arises not from isolated &ldquo;things in themselves&rdquo; or &ldquo;inherent properties&rdquo;, but from relational context.<br>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org108dcdb" class="outline-2">
<h2 id="org108dcdb"><a href="#org108dcdb">Interacting Processes</a></h2>
<div class="outline-text-2" id="text-org108dcdb">
<p>
The primary concept of interaction between processes is the <i>Experience</i>. It seems like a suitable term for low-level as well as higher-level interactions. What does a Process experience? Patterns produced by other Processes, because there isn&rsquo;t anything other than Processes (no backdrop or stage-like &ldquo;environment&rdquo; &#x2013; Processes continuously <i>become</i> (co-evolve) their environment).<br>
</p>

<p>
You can understand Patterns as the raw data of Experience &#x2013; the unrealized potentials, raw data as &rsquo;not-yet-made-sense-of&rsquo;. Patterns are not to be understood as static or dynamic, as this distinction would imply assumptions that are not justified if we look at Patterns in isolation.<br>
</p>

<p>
Consequently, the counterpart Processes are also sharing that Experience. There&rsquo;s nothing to Experience without change; and likewise, change can&rsquo;t happen without (causing) an Experience somewhere: everything that happens, always has <i>some influence</i> on another Process, even if this impact is so subtle that it is virtually imperceptible. Nothing exists in isolation. How Processes handle Experience, is another story.<br>
</p>

<p>
Just recently I stumbled upon <i>π-calculus</i>. Process calculi are models of computation. Right now my understanding is that designing the Protoverse Process interactions might be basically the same as designing a <i>process calculus</i>. I had no chance to look into π-calculus yet, but maybe I could later reconcile ideas in order to refine Process interactions.<br>
</p>
</div>
