blog/artificial-universe-metaphysics.project.html

<div id="outline-container-org13493aa" class="outline-4">
<h4 id="org13493aa"><a href="#org13493aa">Baseline or Reference</a></h4>
<div class="outline-text-4" id="text-org13493aa">
<p>
Due to the lack of an objective reference, the nearest reasonable candidate for a baseline seems to use the notion of &rsquo;self&rsquo;. In this view, the deviation from &rsquo;self&rsquo; could become the reference for registering change [better ideas?].<br>
</p>

<p>
&rsquo;Self&rsquo; must be built from a continuous Process then, which is influenced by Experiences, requiring self-identity to be an ongoing, dynamic process rather than a fixed, unchanging property. So how could we create an abstract notion of &rsquo;self&rsquo; at a very low level?<br>
</p>

<p>
A model of &rsquo;self&rsquo; could be built from a loop by making Processes fundamentally recursive. That paves the way for preserving past states in a continually updated fashion. Recursion can enable feedback, self-adjusting behaviors, keeping state and even various degrees of &rsquo;learning&rsquo;. Recursion could also be a preliminary step towards increasingly complex models of &rsquo;self&rsquo; and its interactions with other Processes.<br>
</p>

<p>
Further, it could make sense to introduce a notion of &rsquo;decay&rsquo; into the recursion, so that the impact of recursive input decreases the further down the recursion chain. This is alike to what we recognize in certain biological and in psychological processes – e.g. when remembrance often favors more recent experiences over older ones when guiding future behavior (recency bias).<br>
</p>

<p>
Not only may the influence of previous Experience decrease as per the decay principle, but also the precision of those past experiences might be degraded — they may become less orderly and more uncertain. It touches in some aspects the concept of <i>entropy</i>.<br>
</p>

<p>
However, the idea of decay smells very bolted-on, and I&rsquo;m not happy with this ad-hoc <i>implementation</i> &ldquo;let there be decay!&rdquo;. As I will have to think really hard about entropy sooner than later, that particular idea of decay for no other than practical reasons may not the be-all and end-all of wisdom.<br>
</p>

<p>
What does all that mean for the Protoverse model?<br>
</p>
</div>
</div>

<div id="outline-container-org82db234" class="outline-4">
<h4 id="org82db234"><a href="#org82db234">Inherent Uncertainty</a></h4>
<div class="outline-text-4" id="text-org82db234">
<p>
The concept of &ldquo;equality&rdquo; (necessary to register difference), is fundamentally an approximation (<a href="https://en.wikipedia.org/wiki/Indeterminacy_(philosophy)#Approximation_versus_equality">I just found out that Nietzsche discovered that too</a>), and therefore introduces uncertainty. This may be a way how the Protoverse could give rise to ontic uncertainty at its lowest level — within the primitive interactions that are primarily concerned about registering difference.<br>
</p>

<p>
This uncertainty makes the entire system fundamentally non-deterministic. From that follows that all kinds of things that we might like to describe as discrete entities (&ldquo;objects&rdquo; or &ldquo;particles&rdquo;) are naturally approximations.<br>
</p>

<p>
It further implies that there&rsquo;s would be no need to include explicit, bolted-on randomness in the Protoverse model. Redefining the meaning of <i>Equality</i> itself would have to happen on the level of logic, and that also means a departure from <i>classical logic</i>.<br>
</p>

<p>
I don&rsquo;t know if it&rsquo;s neccessary or sensible  to augment (or even replace) classical logic in order to build this quantum-like, probablistic resp. non-deterministic system. There are <i>propability theory</i> and the paradigms <i>propablistic programming</i> and <i>non-deterministic programming</i> (I&rsquo;m entirely unfamiliar with both), and these seem to work without touching the underlying logic.<br>
</p>

<p>
However, it feels more intuitive to me (haha!) to operate on the logic level &#x2013; maybe it make sense to adopt <i>fuzzy logic</i>. And while we&rsquo;re at it, we could also ditch the &ldquo;Law of the excluded middle&rdquo;! I&rsquo;ve always been suspicious of it and could never accept it.<br>
</p>

<p>
I don&rsquo;t object Planck&rsquo;s idea of the quantization in quantum mechanics, but that apparent quantization might be a phenomenon that appears due to discretization (for whatever reason) as an effect of the <i>approximation</i> that I mentioned before &#x2013; well, if this actually happens in our universe. Could this unsharpness then provide an understanding of quantum uncertainty?<br>
</p>

<p>
Ok, I&rsquo;m probably mistaken &#x2013; but even if that&rsquo;s just bullshit, it leaves the impression that <i>quantum uncertainty may be not that weird</i> actually (and could be understood intuitively, instead of accepting it at face value); and secondly, this concept might actually work as a computational substrate that shares some commonalities with quantum mechanics.<br>
</p>

<p>
Approximation (and uncertainty) within our universe might be a broadly misunderstood part of nature, rooted in the mistaken assumption that &ldquo;precision&rdquo; must be somehow &ldquo;prior&rdquo;, &ldquo;superior&rdquo; or &ldquo;perfect&rdquo; (looking at you, Plato and Descartes). Does it come from forcing the object-abstraction onto <i>everything</i>, just because the cognitive heuristic that builds objects form observed patterns feels so intuitive?<br>
</p>

<p>
Maybe we could <i>intuitively understand</i> quamtum mechanics (things like the uncertainty principle and particle-wave &ldquo;duality&rsquo;&rdquo;) and not merely accept it at face value, if we shift our perspective from a substantial-materialist (objects, particles, inherent properties) to process-relational worldview (processes, relations, participatory)?<br>
</p>

<p>
<b>TL;DR</b><br>
There are no damn particles (nowhere!) because they would be still (abstract) objects, which are merely approximations (unsharp, uncertain), resulting from a heuristic (applied by an &ldquo;observer&rdquo;) that builds the abstractions &rsquo;object&rsquo; (and other fluff) which are incomplete and distorted descriptions of the underlying processes and relations. Give up on &ldquo;building blocks&rdquo;!<br>
</p>
</div>
</div>

<div id="outline-container-org0c29c13" class="outline-4">
<h4 id="org0c29c13"><a href="#org0c29c13">Navigating Uncertainty</a></h4>
<div class="outline-text-4" id="text-org0c29c13">
<p>
In a universe where uncertainty is inherent, <i>prediction</i> would be an advantageous and  highly desired skill, that most entities have evolved, if the substrate on their scale allows to. Well, <i>if</i>. To get something akin to &rsquo;prediction&rsquo;, but on a scale as low-level as possible, we would do good if we remove the teleological aspect (mindless stuff going on here!), then we wouldn&rsquo;t have &ldquo;prediction&rdquo; any longer, but arrive at &ldquo;evolution&rdquo;.<br>
</p>

<p>
While prediction and evolution may not exactly be the same, both are suitable algorithms for navigating an uncertain/probablistic environment &#x2013; both implementing feedback loops. From a high-level view, their stages correspond effectively:<br>
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Prediction</th>
<th scope="col" class="org-left">Evolution</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Stage 1</td>
<td class="org-left">Assumption</td>
<td class="org-left">Variaton</td>
</tr>

<tr>
<td class="org-left">Stage 2</td>
<td class="org-left">Testing</td>
<td class="org-left">Selection</td>
</tr>

<tr>
<td class="org-left">Stage 3</td>
<td class="org-left">Validation</td>
<td class="org-left">Retention</td>
</tr>

<tr>
<td class="org-left">Stage 1</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
