blog/artificial-universe-metaphysics.project.org
* General Darwinian Evolution

I'm approaching natural selection from the perspective of diversity and adaptability, rather than "survival of the fittest". More often, creatures thrive by finding a niche without destroying their competitors. Darwinian evolution is not a zero-sum game. Let's take a look at the process itself, free from ideological ballast:

Even though first recognized in biology (and hence related to) -- processes not unlike Darwinian Evolution seem to operate within, and propagate through the various Scales apparent in our universe. Evolution may not only be a process across these Scales, but actually /creates/ these.

The specifics of the evolutionary process(es) -- their "implementations" -- differ vastly across the Scales, contingent upon the peculiarities of each respective Scale.

Loosely formulated: Evolution creates it's "inner workings" from whatever "material" is "accessible" from the Scales it is operating at: "genes" at biological Scales, "memes" at cultural Scales -- and whatever "material" there is (and will be) available at other Scales. We'll look at this continuous bootstrapping later in more detail.

Evolution did not "start" with the emergence of the "biological Scale" from the "molecular Scale", neither will it end there. Here's why.

** Algorithmic Nature of Evolution

Evolution (in the Darwinian sense) is a self-establishing, [[https://en.m.wikipedia.org/wiki/Self-perpetuation][self-perpetual]] and [[https://en.m.wikipedia.org/wiki/Positive_feedback][self-reinforcing]] loop (akin to a "virtuous cycle") -- and it has an algorithmic aspect, meaning it is by principle independent from the "substrate" -- the complex system it is part of. Evolutionary Processes consist of interdependent stages, where each stage circularly depends on the others. Each repetition creates and reinforces the conditions for the other stages to function, and so on. Hence, it is a /recursive/ Process.

** The Stages of Evolutionary Processes

So what are the fundamental stages of darwin-like evolution, in an abstract sense? I tried to give the stages generic names, so that the names carry the least possible connotation to a specific substrate. For instance, I don't call the 3rd stage not "inheritance", because that would miss the point what the 3rd stage actually is about. It would only appropriate to call that stage 'inheritance' (or 'information transfer'), when there really are /distinct replicas/ involved (which doesn't always have to be the case, as we will see).

*** Variety
As there cannot be anything perfectly equal to anything else, variety is inevitable in principle. It's just that the next stage (selection) needs to include a criterion that responds to what is different.

*** Selection
The phenomenon of preference does appear to be pervasive in our universe and arises through at least one criterion that acts like a filter (which could be virtually anything). If there is variety and a form of interaction, then selection is inevitable, too.

*** Retention
Retention of information can happen due to various mechanisms. That doesn't have to be replicators or self-replicators. That's just how retention is implemented there, in the form of information transfer and retention via genes.

Other mechanisms capable of retention may fulfill this role in principle (e.g. recursive processes). Even though replicator-alternatives may be much less effective, they could be still "good enough" and the only way of implementation available at other scales of emergent complexity. The adaptive changes then would not be the result of selecting from a variety of reproductions, but rather an iterative process that could retain a memory of former states (retention) and adapt accordingly.

*** Repetition
The loop needs to /contribute/ to increasing the conditions for Stage 1 (variety). One evolutionary process doesn't have to produce variations directly; it's enough when it lead to a system-wide increase of variety, to be picked up by /some/ selection stage.

