blog/artificial-universe-metaphysics.project.html


<div id="outline-container-org3037ffe" class="outline-2">
<h2 id="org3037ffe"><a href="#org3037ffe">General Darwinian Evolution</a></h2>
<div class="outline-text-2" id="text-org3037ffe">
<p>
I&rsquo;m approaching natural selection from the perspective of diversity and adaptability, rather than &ldquo;survival of the fittest&rdquo;. More often, creatures thrive by finding a niche without destroying their competitors. Darwinian evolution is not a zero-sum game. Let&rsquo;s take a look at the process itself, free from ideological ballast:<br>
</p>

<p>
Even though first recognized in biology (and hence related to) &#x2013; processes not unlike Darwinian Evolution seem to operate within, and propagate through the various Scales apparent in our universe. Evolution may not only be a process across these Scales, but actually <i>creates</i> these.<br>
</p>

<p>
The specifics of the evolutionary process(es) &#x2013; their &ldquo;implementations&rdquo; &#x2013; differ vastly across the Scales, contingent upon the peculiarities of each respective Scale.<br>
</p>

<p>
Loosely formulated: Evolution creates it&rsquo;s &ldquo;inner workings&rdquo; from whatever &ldquo;material&rdquo; is &ldquo;accessible&rdquo; from the Scales it is operating at: &ldquo;genes&rdquo; at biological Scales, &ldquo;memes&rdquo; at cultural Scales &#x2013; and whatever &ldquo;material&rdquo; there is (and will be) available at other Scales. We&rsquo;ll look at this continuous bootstrapping later in more detail.<br>
</p>

<p>
Evolution did not &ldquo;start&rdquo; with the emergence of the &ldquo;biological Scale&rdquo; from the &ldquo;molecular Scale&rdquo;, neither will it end there. Here&rsquo;s why.<br>
</p>
</div>

<div id="outline-container-org6523cea" class="outline-3">
<h3 id="org6523cea"><a href="#org6523cea">Algorithmic Nature of Evolution</a></h3>
<div class="outline-text-3" id="text-org6523cea">
<p>
Evolution (in the Darwinian sense) is a self-establishing, <a href="https://en.m.wikipedia.org/wiki/Self-perpetuation">self-perpetual</a> and <a href="https://en.m.wikipedia.org/wiki/Positive_feedback">self-reinforcing</a> loop (akin to a &ldquo;virtuous cycle&rdquo;) &#x2013; and it has an algorithmic aspect, meaning it is by principle independent from the &ldquo;substrate&rdquo; &#x2013; the complex system it is part of. Evolutionary Processes consist of interdependent stages, where each stage circularly depends on the others. Each repetition creates and reinforces the conditions for the other stages to function, and so on. Hence, it is a <i>recursive</i> Process.<br>
</p>
</div>
</div>

<div id="outline-container-org56f498f" class="outline-3">
<h3 id="org56f498f"><a href="#org56f498f">The Stages of Evolutionary Processes</a></h3>
<div class="outline-text-3" id="text-org56f498f">
<p>
So what are the fundamental stages of darwin-like evolution, in an abstract sense? I tried to give the stages generic names, so that the names carry the least possible connotation to a specific substrate. For instance, I don&rsquo;t call the 3rd stage not &ldquo;inheritance&rdquo;, because that would miss the point what the 3rd stage actually is about. It would only appropriate to call that stage &rsquo;inheritance&rsquo; (or &rsquo;information transfer&rsquo;), when there really are <i>distinct replicas</i> involved (which doesn&rsquo;t always have to be the case, as we will see).<br>
</p>
</div>

<div id="outline-container-org61f5f72" class="outline-4">
<h4 id="org61f5f72"><a href="#org61f5f72">Variety</a></h4>
<div class="outline-text-4" id="text-org61f5f72">
<p>
As there cannot be anything perfectly equal to anything else, variety is inevitable in principle. It&rsquo;s just that the next stage (selection) needs to include a criterion that responds to what is different.<br>
</p>
</div>
</div>

<div id="outline-container-orgeaa05e3" class="outline-4">
<h4 id="orgeaa05e3"><a href="#orgeaa05e3">Selection</a></h4>
<div class="outline-text-4" id="text-orgeaa05e3">
<p>
The phenomenon of preference does appear to be pervasive in our universe and arises through at least one criterion that acts like a filter (which could be virtually anything). If there is variety and a form of interaction, then selection is inevitable, too.<br>
</p>
</div>
</div>

<div id="outline-container-org7723820" class="outline-4">
<h4 id="org7723820"><a href="#org7723820">Retention</a></h4>
<div class="outline-text-4" id="text-org7723820">
<p>
Retention of information can happen due to various mechanisms. That doesn&rsquo;t have to be replicators or self-replicators. That&rsquo;s just how retention is implemented there, in the form of information transfer and retention via genes.<br>
</p>

<p>
Other mechanisms capable of retention may fulfill this role in principle (e.g. recursive processes). Even though replicator-alternatives may be much less effective, they could be still &ldquo;good enough&rdquo; and the only way of implementation available at other scales of emergent complexity. The adaptive changes then would not be the result of selecting from a variety of reproductions, but rather an iterative process that could retain a memory of former states (retention) and adapt accordingly.<br>
</p>
</div>
</div>

<div id="outline-container-orga2b4820" class="outline-4">
<h4 id="orga2b4820"><a href="#orga2b4820">Repetition</a></h4>
<div class="outline-text-4" id="text-orga2b4820">
<p>
The loop needs to <i>contribute</i> to increasing the conditions for Stage 1 (variety). One evolutionary process doesn&rsquo;t have to produce variations directly; it&rsquo;s enough when it lead to a system-wide increase of variety, to be picked up by <i>some</i> selection stage.<br>
</p>
</div>
</div>
</div>
