blog/artificial-universe-metaphysics.project.org
** Nested Scales of Emergence

When we contemplate all the dynamic structures in our universe that we've come aware of until yet, we're eager distinguishing various categories, e.g. physical phenomena, biological organisms, social dynamics, informational ecosystems, and so on, along with the epistemological networks we use to describe and understand them.

These categories appear significant to us -- most are associated with one or more areas of research, and we as human animals understand ourselves belonging to several of these categories, and we interact with many others regularly.

But these distinctions also appear arbitrary to some degree, because they have been choosen largely based on intuitive perception, seeming obviousness and meaningfulness, and pragmatic considerations. It's also a bit like dividing species into the phyla "grunters", "humpers", "flyers", "tail-laggers" and "two-eyers". Taxonomy is difficult, because most stuff is usually /multi-dimensional/. So the "humpers" is legit, but maybe it's not useful to put it /always that way/.

When we apply reductionism in order to focus on certain aspects, /choosing the appropriate dimension(s)/ and being consequent about it is crucial when collapsing a dynamically evolving, multi-dimensional, "mycelium-like" structure with fractal properties (well, that's just how I imagine it, but you get the point) into lower dimensions, so that the relations remain meaningful and don't suggest a skewed image that leads to screwed conclusions.

So, is it sensible to erect a border between 'not-living' and 'living'? Well, /it depends/. It depends on what we set out to reason about -- but universal borders, decleard 'valid' across all inquiry are misleading and /very bad/; temporary and purpose-specific borders are indeed /helpful/.

*Nested Scales of Emergence are no entities or fixed structures*, but an aspect of evolution of higher-order Processes, and a view how co-evolving environments /emerge/ trough interscale connectivity (interactions between various "parent Scales" giving birth to new Scales) at the edge of chaos.

Why is this aspect helpful? Because it allows us to see that each of these Scales /has its fundamentally own constitution/ (including "rules"/constants, etc.), while still maintaining its compatibility with other Scales, therefore itself becoming another part of the "substrate" for Processes to operate in.

It means that /how/ darwin-like evolutionary Processes work under the hood -- their implementation -- is fundamentally dependent on the /constitution/ of each Scale and therefore looking different from Scale to Scale, while the /abstract algorithm/ of darwin-style evolution -- the feedback loop of /variety-selection-retention/ -- remains across the Scales.

This principle can be understood as /meta-evolution/, too: evolutinary Processes evolve themselves, while they create (co-evolve) their very own and sucessive environments they operate in. /Same same but different:/ Darwin-style evolution is a shapeshifter hiding in plain sight, because the prevalent, yet mistaken ideas about "identity" and "change" prevent this understanding.

- *'Nested Scales of Emergence' doesn't mean 'higher-order Processes of the same nth-order'.* The Processes associated with a certain Nested Scale of Emergence are a comglomerate (nexus) of many inter-related Processes that form one or more complex systems. These interacting Processes all originated from primitive Processes, but they likely have unique histories, relations and are ultimately composed from different numbers of higher-order and primitive Processes.

  Apart from that: in principle, each Scale could be described as a higher-order Process.  And vice versa, each higher-order Process can be described as a Nested Scale of Emergence. It's just that applying these views emphasizes different aspects.

- *Can Nested Scales of Emergence co-evolve, merge, dissolve or collapse?*
Co-evolution is an integral part and requirement of open-ended evolution. However, the "Nested Scales of Emergence" is just an aspect (view, perspective, facet) to visualize how open-endedness becomes possible; what actually co-evolves are quite simply Processes with Processes. Processes can "merge" (become higher-order Processes), and higher-order Processes can /transform/ into lower-order Processes ("dissolve" or "collapse"), but they cannot simply "disappear", quite like physical Energy cannot "disappear".

*** Phase Transitions

During which evolutionary processes /create/ or /become/ their immediate environment (co-evolve their substrate/environment), phase transitions mark either gradual events or leaps where evolutionary Processes emerge new Nested Scales of Emergence.

Phase transitions can lead to /complexity explosions/, when a new implementation detail appears that exponentially increases /velocity of search space exploration/, /diversity/, /resilence/, /information retention/, /insformation transfer bandwidth/, or else.

Phase transitions don't necessarily lead to higher complexity in newly emerging Scales -- often quite the opposite. On the other side, Scales with less complexity will likely inform the creation of further Scales.

**** Examples

Retrospective: a few examples of remarkable phase transitions to consider. Phase transitions are characterized by catalytic effects.

- Emergence of space
- Gravity (perhaps from an evolutionary "selective pressure" (speed limit?) favoring the trait of /locality/?)
- Appearance of time
- Supernovae distribute [[https://en.wikipedia.org/wiki/CHNOPS][heavier elements (CHNOPS)]], enabling accumulation in planets and assemblage of complex molecules
- The rise of replicators (explosive acceleration of search space exploration via parallel processing; increased diversity)
- Self-replicators (increased redundancy, arms race)
- [[https://en.wikipedia.org/wiki/Eukaryote#Origin_of_eukaryotes][Eukaryogenesis]]
- Photosynthesis (new energy source, but increased oxygen levels ...)
- [[https://en.wikipedia.org/wiki/Evolution_of_sexual_reproduction#Advantages_of_sex_and_sexual_reproduction][Sexual reproduction]] (it's ... complicated)
- Multicellular lifeforms
- Nervous system
- Evolution of consciousness (the great confusor)
- Computers
- The internet
- Artificial intelligence systems (new playground for anthropocentric fantasies)
- ... ?

**** See also:
- John Maynard Smith and Eörs Szathmáry: They authored "[[https://en.wikipedia.org/wiki/The_Major_Transitions_in_Evolution][The Major Transitions in Evolution]]", which focuses on phase transitions in the evolution of life on Earth. They outline several significant transitions such as the origin of chromosomes, eukaryotes, sex, multicellularity, and the development of societies in certain animals.
- Stephen Jay Gould and Niles Eldredge: They proposed the [[https://en.wikipedia.org/wiki/Punctuated_equilibrium][theory of punctuated equilibria]], suggesting that evolutionary change happens in relatively quick, dramatic episodes rather than solely through gradual transformation.

