blog/artificial-universe-metaphysics.project.html

<div id="outline-container-org6c61d25" class="outline-3">
<h3 id="org6c61d25"><a href="#org6c61d25">Nested Scales of Emergence</a></h3>
<div class="outline-text-3" id="text-org6c61d25">
<p>
When we contemplate all the dynamic structures in our universe that we&rsquo;ve come aware of until yet, we&rsquo;re eager distinguishing various categories, e.g. physical phenomena, biological organisms, social dynamics, informational ecosystems, and so on, along with the epistemological networks we use to describe and understand them.<br>
</p>

<p>
These categories appear significant to us &#x2013; most are associated with one or more areas of research, and we as human animals understand ourselves belonging to several of these categories, and we interact with many others regularly.<br>
</p>

<p>
But these distinctions also appear arbitrary to some degree, because they have been choosen largely based on intuitive perception, seeming obviousness and meaningfulness, and pragmatic considerations. It&rsquo;s also a bit like dividing species into the phyla &ldquo;grunters&rdquo;, &ldquo;humpers&rdquo;, &ldquo;flyers&rdquo;, &ldquo;tail-laggers&rdquo; and &ldquo;two-eyers&rdquo;. Taxonomy is difficult, because most stuff is usually <i>multi-dimensional</i>. So the &ldquo;humpers&rdquo; is legit, but maybe it&rsquo;s not useful to put it <i>always that way</i>.<br>
</p>

<p>
When we apply reductionism in order to focus on certain aspects, <i>choosing the appropriate dimension(s)</i> and being consequent about it is crucial when collapsing a dynamically evolving, multi-dimensional, &ldquo;mycelium-like&rdquo; structure with fractal properties (well, that&rsquo;s just how I imagine it, but you get the point) into lower dimensions, so that the relations remain meaningful and don&rsquo;t suggest a skewed image that leads to screwed conclusions.<br>
</p>

<p>
So, is it sensible to erect a border between &rsquo;not-living&rsquo; and &rsquo;living&rsquo;? Well, <i>it depends</i>. It depends on what we set out to reason about &#x2013; but universal borders, decleard &rsquo;valid&rsquo; across all inquiry are misleading and <i>very bad</i>; temporary and purpose-specific borders are indeed <i>helpful</i>.<br>
</p>

<p>
<b>Nested Scales of Emergence are no entities or fixed structures</b>, but an aspect of evolution of higher-order Processes, and a view how co-evolving environments <i>emerge</i> trough interscale connectivity (interactions between various &ldquo;parent Scales&rdquo; giving birth to new Scales) at the edge of chaos.<br>
</p>

<p>
Why is this aspect helpful? Because it allows us to see that each of these Scales <i>has its fundamentally own constitution</i> (including &ldquo;rules&rdquo;/constants, etc.), while still maintaining its compatibility with other Scales, therefore itself becoming another part of the &ldquo;substrate&rdquo; for Processes to operate in.<br>
</p>

<p>
It means that <i>how</i> darwin-like evolutionary Processes work under the hood &#x2013; their implementation &#x2013; is fundamentally dependent on the <i>constitution</i> of each Scale and therefore looking different from Scale to Scale, while the <i>abstract algorithm</i> of darwin-style evolution &#x2013; the feedback loop of <i>variety-selection-retention</i> &#x2013; remains across the Scales.<br>
</p>

<p>
This principle can be understood as <i>meta-evolution</i>, too: evolutinary Processes evolve themselves, while they create (co-evolve) their very own and sucessive environments they operate in. <i>Same same but different:</i> Darwin-style evolution is a shapeshifter hiding in plain sight, because the prevalent, yet mistaken ideas about &ldquo;identity&rdquo; and &ldquo;change&rdquo; prevent this understanding.<br>
</p>

<ul class="org-ul">
<li><p>
<b>&rsquo;Nested Scales of Emergence&rsquo; doesn&rsquo;t mean &rsquo;higher-order Processes of the same nth-order&rsquo;.</b> The Processes associated with a certain Nested Scale of Emergence are a comglomerate (nexus) of many inter-related Processes that form one or more complex systems. These interacting Processes all originated from primitive Processes, but they likely have unique histories, relations and are ultimately composed from different numbers of higher-order and primitive Processes.<br>
</p>

<p>
Apart from that: in principle, each Scale could be described as a higher-order Process.  And vice versa, each higher-order Process can be described as a Nested Scale of Emergence. It&rsquo;s just that applying these views emphasizes different aspects.<br>
</p></li>

<li><b>Can Nested Scales of Emergence co-evolve, merge, dissolve or collapse?</b><br></li>
</ul>
<p>
Co-evolution is an integral part and requirement of open-ended evolution. However, the &ldquo;Nested Scales of Emergence&rdquo; is just an aspect (view, perspective, facet) to visualize how open-endedness becomes possible; what actually co-evolves are quite simply Processes with Processes. Processes can &ldquo;merge&rdquo; (become higher-order Processes), and higher-order Processes can <i>transform</i> into lower-order Processes (&ldquo;dissolve&rdquo; or &ldquo;collapse&rdquo;), but they cannot simply &ldquo;disappear&rdquo;, quite like physical Energy cannot &ldquo;disappear&rdquo;.<br>
</p>
</div>

<div id="outline-container-org9f291e5" class="outline-4">
<h4 id="org9f291e5"><a href="#org9f291e5">Phase Transitions</a></h4>
<div class="outline-text-4" id="text-org9f291e5">
<p>
During which evolutionary processes <i>create</i> or <i>become</i> their immediate environment (co-evolve their substrate/environment), phase transitions mark either gradual events or leaps where evolutionary Processes emerge new Nested Scales of Emergence.<br>
</p>

<p>
Phase transitions can lead to <i>complexity explosions</i>, when a new implementation detail appears that exponentially increases <i>velocity of search space exploration</i>, <i>diversity</i>, <i>resilence</i>, <i>information retention</i>, <i>insformation transfer bandwidth</i>, or else.<br>
</p>

<p>
Phase transitions don&rsquo;t necessarily lead to higher complexity in newly emerging Scales &#x2013; often quite the opposite. On the other side, Scales with less complexity will likely inform the creation of further Scales.<br>
</p>
</div>

<div id="outline-container-orga94f03b" class="outline-5">
<h5 id="orga94f03b"><a href="#orga94f03b">Examples</a></h5>
<div class="outline-text-5" id="text-orga94f03b">
<p>
Retrospective: a few examples of remarkable phase transitions to consider. Phase transitions are characterized by catalytic effects.<br>
</p>

<ul class="org-ul">
<li>Emergence of space<br></li>
<li>Gravity (perhaps from an evolutionary &ldquo;selective pressure&rdquo; (speed limit?) favoring the trait of <i>locality</i>?)<br></li>
<li>Appearance of time<br></li>
<li>Supernovae distribute <a href="https://en.wikipedia.org/wiki/CHNOPS">heavier elements (CHNOPS)</a>, enabling accumulation in planets and assemblage of complex molecules<br></li>
<li>The rise of replicators (explosive acceleration of search space exploration via parallel processing; increased diversity)<br></li>
<li>Self-replicators (increased redundancy, arms race)<br></li>
<li><a href="https://en.wikipedia.org/wiki/Eukaryote#Origin_of_eukaryotes">Eukaryogenesis</a><br></li>
<li>Photosynthesis (new energy source, but increased oxygen levels &#x2026;)<br></li>
<li><a href="https://en.wikipedia.org/wiki/Evolution_of_sexual_reproduction#Advantages_of_sex_and_sexual_reproduction">Sexual reproduction</a> (it&rsquo;s &#x2026; complicated)<br></li>
<li>Multicellular lifeforms<br></li>
<li>Nervous system<br></li>
<li>Evolution of consciousness (the great confusor)<br></li>
<li>Computers<br></li>
<li>The internet<br></li>
<li>Artificial intelligence systems (new playground for anthropocentric fantasies)<br></li>
<li>&#x2026; ?<br></li>
</ul>
</div>
</div>

<div id="outline-container-orge1eeb20" class="outline-5">
<h5 id="orge1eeb20"><a href="#orge1eeb20">See also:</a></h5>
<div class="outline-text-5" id="text-orge1eeb20">
<ul class="org-ul">
<li>John Maynard Smith and Eörs Szathmáry: They authored &ldquo;<a href="https://en.wikipedia.org/wiki/The_Major_Transitions_in_Evolution">The Major Transitions in Evolution</a>&rdquo;, which focuses on phase transitions in the evolution of life on Earth. They outline several significant transitions such as the origin of chromosomes, eukaryotes, sex, multicellularity, and the development of societies in certain animals.<br></li>
<li>Stephen Jay Gould and Niles Eldredge: They proposed the <a href="https://en.wikipedia.org/wiki/Punctuated_equilibrium">theory of punctuated equilibria</a>, suggesting that evolutionary change happens in relatively quick, dramatic episodes rather than solely through gradual transformation.<br></li>
</ul>
</div>
</div>
</div>
