blog/artificial-universe-metaphysics.project.org
*** Do Nested Scales of Emergence Become Increasingly Complex?

Well, deeper Nested Scales of Emergence doesn't mean that such a scale must be more complex "internally": A mountainbike is certainly much less complex than a goldfish. But that's also a very isolated object-centric view that ignores the relational (historical and causal) contexts, which are maintained by the model of interrelated /Processes/ which constitute the two configurations "bike" and "goldfish".

But that, in turn, doesn't mean that bikes and goldfish are determined by their history -- not even if both were destroyed or dead, respectively (they're not destroyed or dead of course: The mountain bike survived its first parachute flight. And the goldfish has met a sexually di-morphic freshwater-shrimp, and they got married just recently).

Complexity is neither a goal, nor a means in itself. How entropy is currently understood, complexity isn't globally increasing, but entropy is. The prevalent opinion says that our universe will result in "heat death" (I doubt that), the most boring equilibrium ever imagined -- which is considered the opposite of complexity. Likewise, a state of lowest possible entropy is considered equally non-complex.

Entropy might turn out way more nuanced than we think it is, and depends on the framework (physics vs. information theory vs. ...). But there's the fact that /replicators/ are involved in certain parts -- replicators replicate by /doubling/, by which entropy decreases exponentially. But also, there can be singular events, like a meteorite, that could wipe out the population of a whole planet (for a while at least).

And ... there's the problem how to define and measure complexity. 'Complexity' is an unwieldy, hand-wavy term and /multi-dimensional/ on top of that. I think that 'complexity' cannot be defined or used in a general fashion, but is framework-dependent, so that the extend and significance of its dimensions have to be adjusted from case to case.

*** There are No Privileged Nested Scales of Emergence

New Scales emerge from the interplay between Processes across several Nested Scales of Emergences. Applied to our universe as a whole there's no reason for an end to Nested Scales of Emergence -- what means there can be vastly more wonderous things than the human mind -- either already existing, or yet to emerge. Watch out for new catalysators!

- "The mind" is often falsely granted a privileged status across many or even all aspects, often a stance of "oooh, you can't simplify it like that, it's sooo much more, and ... and ... what about love?!" -- /yes it is/, but when we examine certain aspects, we have to be /consequent/ and focus on the /aspects/ by filtering out the irrelevant. On this level of abstraction and in relation, "the mind" is to be regarded as one of several /catalysators/ (in good company with "eukaryotes", "photosynthesis" and "sexual reproduction"), leading to a novel substrate like many that came before (and will come after).

- Or the idea that only "the physical" must be the "real thing" and somehow the "fundament" of everything -- the "physical" is just how the Nested Scales of Emergences "below" apper to certain observing complex systems (to us humans, lizard people, catfolk, etc.), because these (we) have evolved from that. "Physics" is observer-dependent appearance according to the perspective of a Process (remember that being an "observer" is not limited to "minds", but a spectrum that includes all Processes).

  We regard stuff as "concrete" and "abstract" for several reasons; one of them is due to we /realize/ that we have no experience, no "physical-grade" grasping of complex systems that arise "above" -- /arising from/ our immediate Scale. We're lacking "natural" means of instantation for these newly arising Scales -- that what we come to consider "abstract"; it seems we must create these means of instantiation first. Well, that's half wrong: We actually /have/ natural means of instantation, but we regard instantiations somehow not "really real" (abstracta), if the instantiation happens on the Scale of our immediate experience -- the mind. Instead, we insist that only instantiation "below" is "real" (concreta). I guess this happens because of how we communicate, with this crazy low bandwidth bottleneck.

  For general AI and artificial life, that might turn out veeery different. Both their (co-evolved) environment plus our native ("physical)" world will appear naturally graspable ("physical") /to them/. But they also can evolve, and give rise to new Nested Scales of Emergence. What will set AI or ALife vastly apart, won't be so much about "processing speed", but will be their incommensurable /communication bandwith/.

#+begin_comment
I've had a hard time to find an appropriate term that doesn't lead to wrong conclusions. The challenge came from trying to define a dynamic, ever-evolving concept accidently with static, structural terminology. It took me so long to realize that, because I've considered structures never as static but always as capable of moving, growing, merging, splitting, etc. Strangely, it seems that most people don't? The other options were "Emergent Dynamics", "Processual Ecologies", "Emergents". Eventually I settled with "Nested Scales of Emergence", but "Processual Ecologies" comes very close, too.
#+end_comment
#+begin_comment
Oh dang! At the first sight, my idea of "Nested Scales of Emergence" and their "phase transitions" seems quite similar to "[[https://en.wikipedia.org/wiki/Metasystem_transition][metasystem transitions]]" theory by [[https://en.wikipedia.org/wiki/Valentin_Turchin][Valentin Turchin]]. He wrote a book "[[http://pespmc1.vub.ac.be/POS/TurPOS.pdf][The Phenomenon of Science]]" (1970). This theory looks quite teleological, though -- and he was a cybernetician, hence "control" appears quite often. And there's [[https://theoperatortheory.info/][operator theory]] (book: "[[https://repository.ubn.ru.nl/bitstream/handle/2066/82605/82605;jsessionid=9F23B2F65AC77A966340A8AC5D569486?sequence=1][The Operator Hierarchy]]") from Gerard Jagers op Akkerhuis, which seems to come close to my notion of higher-order Processes. However, he seems more concerned about "definition of life", while I seek to transcend such boundaries. I'm excited to read both books!
#+end_comment

