blog/artificial-universe-metaphysics.project.html

<div id="outline-container-orgb327d37" class="outline-4">
<h4 id="orgb327d37"><a href="#orgb327d37">Do Nested Scales of Emergence Become Increasingly Complex?</a></h4>
<div class="outline-text-4" id="text-orgb327d37">
<p>
Well, deeper Nested Scales of Emergence doesn&rsquo;t mean that such a scale must be more complex &ldquo;internally&rdquo;: A mountainbike is certainly much less complex than a goldfish. But that&rsquo;s also a very isolated object-centric view that ignores the relational (historical and causal) contexts, which are maintained by the model of interrelated <i>Processes</i> which constitute the two configurations &ldquo;bike&rdquo; and &ldquo;goldfish&rdquo;.<br>
</p>

<p>
But that, in turn, doesn&rsquo;t mean that bikes and goldfish are determined by their history &#x2013; not even if both were destroyed or dead, respectively (they&rsquo;re not destroyed or dead of course: The mountain bike survived its first parachute flight. And the goldfish has met a sexually di-morphic freshwater-shrimp, and they got married just recently).<br>
</p>

<p>
Complexity is neither a goal, nor a means in itself. How entropy is currently understood, complexity isn&rsquo;t globally increasing, but entropy is. The prevalent opinion says that our universe will result in &ldquo;heat death&rdquo; (I doubt that), the most boring equilibrium ever imagined &#x2013; which is considered the opposite of complexity. Likewise, a state of lowest possible entropy is considered equally non-complex.<br>
</p>

<p>
Entropy might turn out way more nuanced than we think it is, and depends on the framework (physics vs. information theory vs. &#x2026;). But there&rsquo;s the fact that <i>replicators</i> are involved in certain parts &#x2013; replicators replicate by <i>doubling</i>, by which entropy decreases exponentially. But also, there can be singular events, like a meteorite, that could wipe out the population of a whole planet (for a while at least).<br>
</p>

<p>
And &#x2026; there&rsquo;s the problem how to define and measure complexity. &rsquo;Complexity&rsquo; is an unwieldy, hand-wavy term and <i>multi-dimensional</i> on top of that. I think that &rsquo;complexity&rsquo; cannot be defined or used in a general fashion, but is framework-dependent, so that the extend and significance of its dimensions have to be adjusted from case to case.<br>
</p>
</div>
</div>

<div id="outline-container-orga65c79d" class="outline-4">
<h4 id="orga65c79d"><a href="#orga65c79d">There are No Privileged Nested Scales of Emergence</a></h4>
<div class="outline-text-4" id="text-orga65c79d">
<p>
New Scales emerge from the interplay between Processes across several Nested Scales of Emergences. Applied to our universe as a whole there&rsquo;s no reason for an end to Nested Scales of Emergence &#x2013; what means there can be vastly more wonderous things than the human mind &#x2013; either already existing, or yet to emerge. Watch out for new catalysators!<br>
</p>

<ul class="org-ul">
<li>&ldquo;The mind&rdquo; is often falsely granted a privileged status across many or even all aspects, often a stance of &ldquo;oooh, you can&rsquo;t simplify it like that, it&rsquo;s sooo much more, and &#x2026; and &#x2026; what about love?!&rdquo; &#x2013; <i>yes it is</i>, but when we examine certain aspects, we have to be <i>consequent</i> and focus on the <i>aspects</i> by filtering out the irrelevant. On this level of abstraction and in relation, &ldquo;the mind&rdquo; is to be regarded as one of several <i>catalysators</i> (in good company with &ldquo;eukaryotes&rdquo;, &ldquo;photosynthesis&rdquo; and &ldquo;sexual reproduction&rdquo;), leading to a novel substrate like many that came before (and will come after).<br></li>

<li><p>
Or the idea that only &ldquo;the physical&rdquo; must be the &ldquo;real thing&rdquo; and somehow the &ldquo;fundament&rdquo; of everything &#x2013; the &ldquo;physical&rdquo; is just how the Nested Scales of Emergences &ldquo;below&rdquo; apper to certain observing complex systems (to us humans, lizard people, catfolk, etc.), because these (we) have evolved from that. &ldquo;Physics&rdquo; is observer-dependent appearance according to the perspective of a Process (remember that being an &ldquo;observer&rdquo; is not limited to &ldquo;minds&rdquo;, but a spectrum that includes all Processes).<br>
</p>

<p>
We regard stuff as &ldquo;concrete&rdquo; and &ldquo;abstract&rdquo; for several reasons; one of them is due to we <i>realize</i> that we have no experience, no &ldquo;physical-grade&rdquo; grasping of complex systems that arise &ldquo;above&rdquo; &#x2013; <i>arising from</i> our immediate Scale. We&rsquo;re lacking &ldquo;natural&rdquo; means of instantation for these newly arising Scales &#x2013; that what we come to consider &ldquo;abstract&rdquo;; it seems we must create these means of instantiation first. Well, that&rsquo;s half wrong: We actually <i>have</i> natural means of instantation, but we regard instantiations somehow not &ldquo;really real&rdquo; (abstracta), if the instantiation happens on the Scale of our immediate experience &#x2013; the mind. Instead, we insist that only instantiation &ldquo;below&rdquo; is &ldquo;real&rdquo; (concreta). I guess this happens because of how we communicate, with this crazy low bandwidth bottleneck.<br>
</p>

<p>
For general AI and artificial life, that might turn out veeery different. Both their (co-evolved) environment plus our native (&ldquo;physical)&rdquo; world will appear naturally graspable (&ldquo;physical&rdquo;) <i>to them</i>. But they also can evolve, and give rise to new Nested Scales of Emergence. What will set AI or ALife vastly apart, won&rsquo;t be so much about &ldquo;processing speed&rdquo;, but will be their incommensurable <i>communication bandwith</i>.<br>
</p></li>
</ul>
</div>
</div>
</div>
