blog/artificial-universe-metaphysics.project.org
*** Examples

- *Variety Generation*
   - Original Implementation: Random mutations, genetic drift.
   - Evolving Implementations:
     + Sexual Reproduction: Introduced recombination, crossing over, and independent assortment, providing new mechanisms to generate variation.
     + Gene Duplication: Allowed for redundancy in genetic material, providing opportunities for one copy to develop new functions without the loss of the original gene's function.
     + Horizontal Gene Transfer and Endosymbiosis: In bacteria and early eukaryotic cells, respectively, provided mechanisms for acquiring genetic material from other organisms, expanding the potential for new traits.

- *Selection*
   - Original Implementation: Differential survival and reproduction in a given environment.
   - Evolving Implementations:
     + Multicellular Organisms: Introduced new levels of selection, including cellular (cancer cells vs. normal cells), organismal (individuals within a species), and group (between groups of social organisms) selection.
     + Behavioral Adaptations: With the rise of nervous systems, selection operated not just on inherited physical traits but also on learned behaviors, adding a new layer to the selection process.
     + Kin Selection and Social Selection: In social animals, including insects and mammals, behaviors that benefit relatives or group members can be selected for, even if they represent a cost to the individual.

- *Retention*
   - Original Implementation: Vertical transmission of genetic material from parent to offspring.
   - Evolving Implementations:
     + Epigenetics: Introduced mechanisms (such as DNA methylation and histone modification) that can produce heritable changes in gene expression without altering the underlying genetic code.
     + Multicellularity with Germline-Soma Differentiation: Separation of germline cells ensured that changes beneficial for reproduction could be retained and passed on, while somatic mutations would not.
     + Cultural Evolution: Particularly in humans, retention shifted from purely genetic to include the transmission of learned information across generations, profoundly affecting the direction and speed of human evolution.

*** Research Concerning the Evolution of Evolution (Meta-Evolution)

- [[https://en.wikipedia.org/wiki/Evolvability][Evolvability]] investigates if and how /biological/ systems can evolve, and also the [[https://en.wikipedia.org/wiki/Evolvability#Evolution_of_evolvability][evolution of evolvability]]. Amongst others, the enhancement of selection has been recognized.
- Richard Dawkins has discussed in his book "The Selfish Gene" how the process of natural selection itself can select for traits that make evolution more effective.


*** Entropy and its Relation to Evolutionary Processes

While Entropy deserves a top level section on its own, I found no proper place to introduce it earlier, but we need to consider Entropy in the context of Universal Darwinism in order to understand why change -- or rather /why anything happens/ at all.

Decrease in Entropy through Increased Entanglement (and Information)

The evolutionary cycle, once established, decreases entropy by increasing relations (entanglement), therefore it creates knowledge about state, and also increases and propagates the resulting information throughout the system.

The cycle decreases entropy, and it does so in whatherver scale its operating -- in principle, there are no living systems required for its effect.

Once living systems appear, they decrease entropy even further while they are /becoming their own environment/, as a means of the evolutionary process creating and establishing this scale of complexity (from which further scales emerge, where the evolutionary process continues. The process' "implementation" is going to be different then, depending on the peculiarities of these newly emerging scales of complexity).

*** Reception of Universal Darwinism

While the application of evolutionary concepts to non-biological systems is [[https://en.m.wikipedia.org/wiki/Universal_Darwinism][widely recognized within science]], there's no generalization of Darwinian evolution (yet).

Critics argue that darwin-style mechanisms cannot be directly applied to non-biological systems or that doing so oversimplifies the complexities and unique features of different domains.

I think this view results from /mistaking the implementation details/ of darwinian-like evolutionary processes for the processes themselves, which can be defined by their algorithmic commonalities and effiacy. This is understandable, because these implementation details of evolutionary processes are vastly /diverse/ across the Scales, as these implementations are subject to evolution themselves.

Moreover, these Scales often map 1:1 to distinct (and in many ways isolated) scientific disciplines, each of them with their own standards, languages and methods, as scholars and scientists traditionally work within the boundaries of their disciplines.

There are several other reasons (organisational, political, ideological, emotional, ...), but pondering on that is not in scope of this framework.

#+begin_quote
The notion of darwinian-style general evolution (commonly termed "Universal Darwinism") may be an essential principle of the universe, and if there could be a "Theory Of Everything" (TOE) that could explain why phenomena exist at all, then this is it. Even gravity could have emerged, or evolved from evolutionary Processes.
--Dan Dee (said it first, 2023)
#+end_quote

But even if general evolution is "the TOE", we might be /unable to reproduce all or any phenomena/ present in our universe, not just because of some arbitrary limits, but because of over-sensitivity to initial conditions (and maybe non-determinism): emerging "laws" (observed constants) may turn out differently or entirely absent, even if we get it right, up and running.

