blog/artificial-universe-metaphysics.project.html

<div id="outline-container-org7c0d69d" class="outline-4">
<h4 id="org7c0d69d"><a href="#org7c0d69d">Examples</a></h4>
<div class="outline-text-4" id="text-org7c0d69d">
<ul class="org-ul">
<li><b>Variety Generation</b><br>
<ul class="org-ul">
<li>Original Implementation: Random mutations, genetic drift.<br></li>
<li>Evolving Implementations:<br>
<ul class="org-ul">
<li>Sexual Reproduction: Introduced recombination, crossing over, and independent assortment, providing new mechanisms to generate variation.<br></li>
<li>Gene Duplication: Allowed for redundancy in genetic material, providing opportunities for one copy to develop new functions without the loss of the original gene&rsquo;s function.<br></li>
<li>Horizontal Gene Transfer and Endosymbiosis: In bacteria and early eukaryotic cells, respectively, provided mechanisms for acquiring genetic material from other organisms, expanding the potential for new traits.<br></li>
</ul></li>
</ul></li>

<li><b>Selection</b><br>
<ul class="org-ul">
<li>Original Implementation: Differential survival and reproduction in a given environment.<br></li>
<li>Evolving Implementations:<br>
<ul class="org-ul">
<li>Multicellular Organisms: Introduced new levels of selection, including cellular (cancer cells vs. normal cells), organismal (individuals within a species), and group (between groups of social organisms) selection.<br></li>
<li>Behavioral Adaptations: With the rise of nervous systems, selection operated not just on inherited physical traits but also on learned behaviors, adding a new layer to the selection process.<br></li>
<li>Kin Selection and Social Selection: In social animals, including insects and mammals, behaviors that benefit relatives or group members can be selected for, even if they represent a cost to the individual.<br></li>
</ul></li>
</ul></li>

<li><b>Retention</b><br>
<ul class="org-ul">
<li>Original Implementation: Vertical transmission of genetic material from parent to offspring.<br></li>
<li>Evolving Implementations:<br>
<ul class="org-ul">
<li>Epigenetics: Introduced mechanisms (such as DNA methylation and histone modification) that can produce heritable changes in gene expression without altering the underlying genetic code.<br></li>
<li>Multicellularity with Germline-Soma Differentiation: Separation of germline cells ensured that changes beneficial for reproduction could be retained and passed on, while somatic mutations would not.<br></li>
<li>Cultural Evolution: Particularly in humans, retention shifted from purely genetic to include the transmission of learned information across generations, profoundly affecting the direction and speed of human evolution.<br></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd37ba61" class="outline-4">
<h4 id="orgd37ba61"><a href="#orgd37ba61">Research Concerning the Evolution of Evolution (Meta-Evolution)</a></h4>
<div class="outline-text-4" id="text-orgd37ba61">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Evolvability">Evolvability</a> investigates if and how <i>biological</i> systems can evolve, and also the <a href="https://en.wikipedia.org/wiki/Evolvability#Evolution_of_evolvability">evolution of evolvability</a>. Amongst others, the enhancement of selection has been recognized.<br></li>
<li>Richard Dawkins has discussed in his book &ldquo;The Selfish Gene&rdquo; how the process of natural selection itself can select for traits that make evolution more effective.<br></li>
</ul>
</div>
</div>


<div id="outline-container-org19cddad" class="outline-4">
<h4 id="org19cddad"><a href="#org19cddad">Entropy and its Relation to Evolutionary Processes</a></h4>
<div class="outline-text-4" id="text-org19cddad">
<p>
While Entropy deserves a top level section on its own, I found no proper place to introduce it earlier, but we need to consider Entropy in the context of Universal Darwinism in order to understand why change &#x2013; or rather <i>why anything happens</i> at all.<br>
</p>

<p>
Decrease in Entropy through Increased Entanglement (and Information)<br>
</p>

<p>
The evolutionary cycle, once established, decreases entropy by increasing relations (entanglement), therefore it creates knowledge about state, and also increases and propagates the resulting information throughout the system.<br>
</p>

<p>
The cycle decreases entropy, and it does so in whatherver scale its operating &#x2013; in principle, there are no living systems required for its effect.<br>
</p>

<p>
Once living systems appear, they decrease entropy even further while they are <i>becoming their own environment</i>, as a means of the evolutionary process creating and establishing this scale of complexity (from which further scales emerge, where the evolutionary process continues. The process&rsquo; &ldquo;implementation&rdquo; is going to be different then, depending on the peculiarities of these newly emerging scales of complexity).<br>
</p>
</div>
</div>

<div id="outline-container-org3d4591d" class="outline-4">
<h4 id="org3d4591d"><a href="#org3d4591d">Reception of Universal Darwinism</a></h4>
<div class="outline-text-4" id="text-org3d4591d">
<p>
While the application of evolutionary concepts to non-biological systems is <a href="https://en.m.wikipedia.org/wiki/Universal_Darwinism">widely recognized within science</a>, there&rsquo;s no generalization of Darwinian evolution (yet).<br>
</p>

<p>
Critics argue that darwin-style mechanisms cannot be directly applied to non-biological systems or that doing so oversimplifies the complexities and unique features of different domains.<br>
</p>

<p>
I think this view results from <i>mistaking the implementation details</i> of darwinian-like evolutionary processes for the processes themselves, which can be defined by their algorithmic commonalities and effiacy. This is understandable, because these implementation details of evolutionary processes are vastly <i>diverse</i> across the Scales, as these implementations are subject to evolution themselves.<br>
</p>

<p>
Moreover, these Scales often map 1:1 to distinct (and in many ways isolated) scientific disciplines, each of them with their own standards, languages and methods, as scholars and scientists traditionally work within the boundaries of their disciplines.<br>
</p>

<p>
There are several other reasons (organisational, political, ideological, emotional, &#x2026;), but pondering on that is not in scope of this framework.<br>
</p>

<blockquote>
<p>
The notion of darwinian-style general evolution (commonly termed &ldquo;Universal Darwinism&rdquo;) may be an essential principle of the universe, and if there could be a &ldquo;Theory Of Everything&rdquo; (TOE) that could explain why phenomena exist at all, then this is it. Even gravity could have emerged, or evolved from evolutionary Processes.<br>
&#x2013;Dan Dee (said it first, 2023)<br>
</p>
</blockquote>

<p>
But even if general evolution is &ldquo;the TOE&rdquo;, we might be <i>unable to reproduce all or any phenomena</i> present in our universe, not just because of some arbitrary limits, but because of over-sensitivity to initial conditions (and maybe non-determinism): emerging &ldquo;laws&rdquo; (observed constants) may turn out differently or entirely absent, even if we get it right, up and running.<br>
</p>
</div>
</div>
</div>
