blog/artificial-universe-metaphysics.project.org
** Darwin-style Evolution in a Synthetic Universe

Evolutionary computation often employs extrinsic, goal-directed forms of evolutionary processes -- because genetic algorithms are used to solve practical problems, and even if not, they operate within an isolated setting, where the environment often serves as a modest backdrop.

This project's approach is a bit different from that: The aim here is to build a non-deterministic, nonlinear computational substrate where intrinsic, open-ended evolutionary processes are the consequential outcome of systemic interactions.

From a process-relational perspective, Processes resist "extinction" and continue evolving because they aren't susceptible to death. This could enable /direct knowledge inheritance/, which means that Processes can pass on information without a selection process acting on replicated variations. It might accelerate evolution, when favorable developments are preserved and propagated directly, without the need to be "rediscovered" by each new generation through replication and selection.

  Compared to replication-based evolution, there are potential drawbacks to consider:

  - Replication leverages parallel processing, by which a large search space is explored quite fast, and the resulting diversity

  Evolution not based on replication doesn't rule out the emergence of evolution which is based on replication, as the latter could arise as a more effective strategy on certain scales of emerging complexity..

*** Necessary Conditions for Open-Ended Evolution

I believe that evolutionary processes arise intrinsically in certain kinds of complex systems, because the constutients -- variation, selection, retention -- are already present in complex systems at the edge of chaos, in form of various Processes that can fill these roles.

- *Background independence:* There is no distinction between "entities" and "environment", because the entities are Processes and they are /becoming/ their "environment". What we conventionally consider to be "entities" are relations of processes, and the "environment" is not a separate canvas, but is constituted by the network of interactions among these Processes, and the relations created thereof. A half-assed version of that is commonly understood as "co-evolution".

- *Emergence of higher-order Processes:* It seems that one requirement for open-ended evolution and true novelty is to enable phase transitions which lead to the emergence of nested scales of higher-order complexity. In natural evolution, this emergence of higher-order scales (e.g. molecules to cells to organisms) is a hallmark of the open-endedness.

- *Inter-Process compatibility:* Novel phenomena most likely emerge at the edge of chaos. Higher-order and lower-order Processes must be compatible to interact meaningfully; but compatibility is only guaranteed between primitive Processes; higher-order Processes are expected to evolve novel ways of interaction.

- *Co-evolving epistemological scope* and interfaces

- *Meta-evolution:* I suggest an interpretation of evolution where "the rules" themselves can change, creating another, or more levels of evolution beyond the initial one. Here, the Processes aren't just aligned to initial rules but also are effective in creating and changing rules, independent of survival pressures (analogy: wave diffraction)

- *Oscillators:* Disruptions at regular intervals may help to migitate premature convergence (settling into a fixed approach too early). Cycles similar to day/night, tides or seasonal changes are examples of such periodic perturbations.

- Probablistic / non-deterministic system

- Edge of Chaos

- Black Swan Events

# There will be some kind of "selection" that is applied in a broader sense than natural selection in biological evolution. We know how this works in genetics, but I think the principles of "selection" /(I will expand on this; deep-dive required)/ apply universally; biology/genetics is just one way of implementation, although in a higher-order substrate.

# diversity maintenance and novelty search; the focus should be on expanding the objectives of evolutionary computation, not just optimizing specific problem solutions, but also modeling the genuine, open-ended evolutionary processes observed in nature, complete with environmental variations, multi-objective optimization, and aspects of co-evolution.

*** Drivers of Computational Evolution

In the Protoverse, the aim of evolution could be seen as a drive for novelty, exploration, understanding, creativity and sophistication rather than survival:

- The process-relational model I described so far introduces uncertainty naturally, because anything we would recognize as discrete objects (physical things, individuals, identities, integers, etc) are approximations to begin with.

-  Realizing and acknowledging novel situations or patterns created by the evolution of interacting processes is quite a challenge. It's central to a Process' ability of any order to adapt, learn, and evolve (Processes are recursive).

- Each Process has its subjective experience (and it's own reality). As processes interact, evolve and become part of more complex Processes, the nature of subjective experience will become more nuanced. Adapting to and striving for consensus (e.g. a shared reality between processes) will pose a challenge.

- In an universe where Experience exists on a spectrum, emergent phenomena will lead to new forms/domains of experience. This phenomenological richness can drive Processes to continuously evolve, in order to further explore and understand the diversity of Experiences.

- In a post-scarcity environment, the challenge isn’t to secure resources, but to make sense of information.


* Meta

** Design Guidelines

- Worry later about practicability! (no premature optimization): I do not think much about practicability right now, as I want to explore and develop the ideas first. That's why I start with a "metaphysical framework", which is essentially a speculative construct, that I try to make clearer and coherent with each iteration. Later I can consider the implementation specifics and how to tackle any challenges that might come with them.

- One of the goals for this ontology is to spot assumptions largely rooted in anthropocentrism as thoroughly as possible and resolve those. It will not be perfect of course but an ongoing process, and I think this is neccessary good practise.

- Prefer the bottom-up approach: when designing the Protoverse ontology, my fundamental premise is that all phenomena are emergent by nature. Only when this assumption ceases to provide meaningful insights, I do consider classifying the phenomenon in question as fundamental.

- Process philosophy's view of reality: Reality is not made up of static substances but rather of ongoing activities. Where I encounter a complex functionality, instead of trying to pin down a rigid structure for it, I could choose to view it as a dynamic process and look where that leads to.

- Events as entities: Things could be seen as events. So, instead of thinking in terms of true or false state of entities, I could focus on the transitions - the changes in the states -- just like an event-driven system.

* Scratchpad

** Felt like it meant something; might delete later

