blog/artificial-universe-metaphysics.project.html

<div id="outline-container-orgdbfdb99" class="outline-3">
<h3 id="orgdbfdb99"><a href="#orgdbfdb99">Darwin-style Evolution in a Synthetic Universe</a></h3>
<div class="outline-text-3" id="text-orgdbfdb99">
<p>
Evolutionary computation often employs extrinsic, goal-directed forms of evolutionary processes &#x2013; because genetic algorithms are used to solve practical problems, and even if not, they operate within an isolated setting, where the environment often serves as a modest backdrop.<br>
</p>

<p>
This project&rsquo;s approach is a bit different from that: The aim here is to build a non-deterministic, nonlinear computational substrate where intrinsic, open-ended evolutionary processes are the consequential outcome of systemic interactions.<br>
</p>

<p>
From a process-relational perspective, Processes resist &ldquo;extinction&rdquo; and continue evolving because they aren&rsquo;t susceptible to death. This could enable <i>direct knowledge inheritance</i>, which means that Processes can pass on information without a selection process acting on replicated variations. It might accelerate evolution, when favorable developments are preserved and propagated directly, without the need to be &ldquo;rediscovered&rdquo; by each new generation through replication and selection.<br>
</p>

<p>
Compared to replication-based evolution, there are potential drawbacks to consider:<br>
</p>

<ul class="org-ul">
<li>Replication leverages parallel processing, by which a large search space is explored quite fast, and the resulting diversity<br></li>
</ul>

<p>
Evolution not based on replication doesn&rsquo;t rule out the emergence of evolution which is based on replication, as the latter could arise as a more effective strategy on certain scales of emerging complexity..<br>
</p>
</div>

<div id="outline-container-orge7a5fbd" class="outline-4">
<h4 id="orge7a5fbd"><a href="#orge7a5fbd">Necessary Conditions for Open-Ended Evolution</a></h4>
<div class="outline-text-4" id="text-orge7a5fbd">
<p>
I believe that evolutionary processes arise intrinsically in certain kinds of complex systems, because the constutients &#x2013; variation, selection, retention &#x2013; are already present in complex systems at the edge of chaos, in form of various Processes that can fill these roles.<br>
</p>

<ul class="org-ul">
<li><b>Background independence:</b> There is no distinction between &ldquo;entities&rdquo; and &ldquo;environment&rdquo;, because the entities are Processes and they are <i>becoming</i> their &ldquo;environment&rdquo;. What we conventionally consider to be &ldquo;entities&rdquo; are relations of processes, and the &ldquo;environment&rdquo; is not a separate canvas, but is constituted by the network of interactions among these Processes, and the relations created thereof. A half-assed version of that is commonly understood as &ldquo;co-evolution&rdquo;.<br></li>

<li><b>Emergence of higher-order Processes:</b> It seems that one requirement for open-ended evolution and true novelty is to enable phase transitions which lead to the emergence of nested scales of higher-order complexity. In natural evolution, this emergence of higher-order scales (e.g. molecules to cells to organisms) is a hallmark of the open-endedness.<br></li>

<li><b>Inter-Process compatibility:</b> Novel phenomena most likely emerge at the edge of chaos. Higher-order and lower-order Processes must be compatible to interact meaningfully; but compatibility is only guaranteed between primitive Processes; higher-order Processes are expected to evolve novel ways of interaction.<br></li>

<li><b>Co-evolving epistemological scope</b> and interfaces<br></li>

<li><b>Meta-evolution:</b> I suggest an interpretation of evolution where &ldquo;the rules&rdquo; themselves can change, creating another, or more levels of evolution beyond the initial one. Here, the Processes aren&rsquo;t just aligned to initial rules but also are effective in creating and changing rules, independent of survival pressures (analogy: wave diffraction)<br></li>

<li><b>Oscillators:</b> Disruptions at regular intervals may help to migitate premature convergence (settling into a fixed approach too early). Cycles similar to day/night, tides or seasonal changes are examples of such periodic perturbations.<br></li>

<li>Probablistic / non-deterministic system<br></li>

<li>Edge of Chaos<br></li>

<li>Black Swan Events<br></li>
</ul>
</div>
</div>

<div id="outline-container-orgc302bc9" class="outline-4">
<h4 id="orgc302bc9"><a href="#orgc302bc9">Drivers of Computational Evolution</a></h4>
<div class="outline-text-4" id="text-orgc302bc9">
<p>
In the Protoverse, the aim of evolution could be seen as a drive for novelty, exploration, understanding, creativity and sophistication rather than survival:<br>
</p>

<ul class="org-ul">
<li>The process-relational model I described so far introduces uncertainty naturally, because anything we would recognize as discrete objects (physical things, individuals, identities, integers, etc) are approximations to begin with.<br></li>

<li>Realizing and acknowledging novel situations or patterns created by the evolution of interacting processes is quite a challenge. It&rsquo;s central to a Process&rsquo; ability of any order to adapt, learn, and evolve (Processes are recursive).<br></li>

<li>Each Process has its subjective experience (and it&rsquo;s own reality). As processes interact, evolve and become part of more complex Processes, the nature of subjective experience will become more nuanced. Adapting to and striving for consensus (e.g. a shared reality between processes) will pose a challenge.<br></li>

<li>In an universe where Experience exists on a spectrum, emergent phenomena will lead to new forms/domains of experience. This phenomenological richness can drive Processes to continuously evolve, in order to further explore and understand the diversity of Experiences.<br></li>

<li>In a post-scarcity environment, the challenge isn’t to secure resources, but to make sense of information.<br></li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org00aebe0" class="outline-2">
<h2 id="org00aebe0"><a href="#org00aebe0">Meta</a></h2>
<div class="outline-text-2" id="text-org00aebe0">
</div>
<div id="outline-container-orge2468f4" class="outline-3">
<h3 id="orge2468f4"><a href="#orge2468f4">Design Guidelines</a></h3>
<div class="outline-text-3" id="text-orge2468f4">
<ul class="org-ul">
<li>Worry later about practicability! (no premature optimization): I do not think much about practicability right now, as I want to explore and develop the ideas first. That&rsquo;s why I start with a &ldquo;metaphysical framework&rdquo;, which is essentially a speculative construct, that I try to make clearer and coherent with each iteration. Later I can consider the implementation specifics and how to tackle any challenges that might come with them.<br></li>

<li>One of the goals for this ontology is to spot assumptions largely rooted in anthropocentrism as thoroughly as possible and resolve those. It will not be perfect of course but an ongoing process, and I think this is neccessary good practise.<br></li>

<li>Prefer the bottom-up approach: when designing the Protoverse ontology, my fundamental premise is that all phenomena are emergent by nature. Only when this assumption ceases to provide meaningful insights, I do consider classifying the phenomenon in question as fundamental.<br></li>

<li>Process philosophy&rsquo;s view of reality: Reality is not made up of static substances but rather of ongoing activities. Where I encounter a complex functionality, instead of trying to pin down a rigid structure for it, I could choose to view it as a dynamic process and look where that leads to.<br></li>

<li>Events as entities: Things could be seen as events. So, instead of thinking in terms of true or false state of entities, I could focus on the transitions - the changes in the states &#x2013; just like an event-driven system.<br></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org430e714" class="outline-2">
<h2 id="org430e714"><a href="#org430e714">Scratchpad</a></h2>
<div class="outline-text-2" id="text-org430e714">
</div>
<div id="outline-container-orgc7a4c6f" class="outline-3">
<h3 id="orgc7a4c6f"><a href="#orgc7a4c6f">Felt like it meant something; might delete later</a></h3>
<div class="outline-text-3" id="text-orgc7a4c6f">
</div>
