blog/artificial-universe-metaphysics.project.html
<div id="outline-container-org82eab89" class="outline-4">
<h4 id="org82eab89"><a href="#org82eab89">Delimited Relational State Update</a></h4>
<div class="outline-text-4" id="text-org82eab89">
<p>
Crude idea how interaction between Processes might work &#x2013; or not:<br>
</p>

<p>
Theoretically you could &ldquo;ask&rdquo; a Process for a Property, at any occasion (provided a interface or device that let&rsquo;s you interact with a specific Process), and it will give you an answer &#x2013; it will <i>realize this Property</i> in turn. Note: that Property hasn&rsquo;t there before, it will be generated. So as an example, let&rsquo;s ask a Process for its &ldquo;identity&rdquo;:<br>
</p>

<p>
How does the Process understand the request? Based on what language or protocol? And how does a Process &ldquo;know&rdquo; or &ldquo;decide&rdquo; what to respond to our specific question?<br>
</p>

<p>
Well, all that complicated stuff like protocols would be entirely superflous, if the Process wouldn&rsquo;t have to &ldquo;know&rdquo; or &ldquo;decide&rdquo; what to respond. And that can be so, under the circumstance that it <i>only can do one thing</i>, and responds with <i>one thing</i> subsequently.<br>
</p>

<p>
If a Process only can do <i>one thing</i> and responds according to that, then the Process cannot and doesn&rsquo;t need to &ldquo;understand&rdquo; the question to begin with. For the Process it makes no difference if you ask it for its &ldquo;identity&rdquo; or &ldquo;position&rdquo; or &ldquo;spin&rdquo;, as long your question is well-formed. It will <i>do its one thing</i> and therefore generate its answer.<br>
</p>

<p>
Each &ldquo;question&rdquo; (you may call it &ldquo;measurement&rdquo; at this point) is superficially just a trigger for the Process to realize its <i>relational state</i> &#x2013; this is the <i>one thing</i> it does and can do.<br>
</p>

<p>
The missing link: Whatever is connected to this Process during the query (which may include probablistic anticipations and uncertainties), becomes an integral part of the relational state it realizes when triggered &#x2013; that relational state <i>includes you</i> (by your interface or measuring device) &#x2013; a bit like if the process takes a selfie with you in it. More accurately, it includes the <i>processes that are you</i> and their relational states (there are plenty).<br>
</p>

<p>
It&rsquo;s up to you to interpret the reply from the Process, which is like an oracle. Like an oracle&rsquo;s gibberish, the Process&rsquo; reply is entirely meaningless in itself. But as you have setup everything in order to ask the process a specific question (in this example, for a Property), it happened that you framed and narrowed down the answer (to a <i>certain precision</i>).<br>
</p>

<p>
The Process did not &ldquo;answer&rdquo; your question of course, since it couldn&rsquo;t even understand it. The reply that came from the Process, is eventually more like a hash value that completed and closed this specific loop.<br>
</p>

<p>
What does a relational state include, is there a limit or border how far or deep this relational state reaches? What&rsquo;s included and what not? What does the realization of a relational state require &#x2013; does it have a &ldquo;time&rdquo; duration or other &rsquo;cost&rsquo;, depending on what? Does this &ldquo;border&rdquo; expand, and does this expansion vary?<br>
</p>

<p>
Ok, let&rsquo;s assume that the effort to realize (&ldquo;query&rdquo;) very complex relational states (more nested or far-reaching relations) is higher than the effort to realize relational states of lower complexity (less relations, trivially structured, or not so far-reaching).<br>
</p>

<p>
&rsquo;Far-reaching&rsquo; in this sense could either mean &rsquo;in time&rsquo;, &rsquo;in space&rsquo;, both, or neither. We must consider that time, space and various physical phenomena may arise from the realization of relational states, rather than assuming these phenomena a priori. So there&rsquo;s a &rsquo;cost&rsquo; involved in realizing relational state.<br>
</p>

<p>
We may assume that realizing very complex relational state may require a huge effort. This could be expected if two vast conglomerates of processes with are constituted through a vast amount of relations interact.<br>
</p>
</div>
</div>

<div id="outline-container-orgd8c0114" class="outline-4">
<h4 id="orgd8c0114"><a href="#orgd8c0114">Is There an Ultimate Reality?</a></h4>
<div class="outline-text-4" id="text-orgd8c0114">
<p>
Taken the term in its original meaning, immediately breaks out from the Protoverse, through all scales of our known world and seeks to get hold of the most profound. I don&rsquo;t regard the question as nonsensical, but rather as a tool for personal reflection of one&rsquo;s current state of mind. It shows the values, biases, where the focus is, and the voids &#x2013; uncharted territories for planning the next <del>vacation</del> expedition. It seems a good idea to answer this question from time to time. Let&rsquo;s try:<br>
</p>

<p>
Currently, I hold the view that what we commonly expect to count as &ldquo;ultimate reality&rdquo; is multi-faceted &#x2013; much like in a sense that we could hypothetically develop several equally meaningful perspectives, like say highly developed &ldquo;theories of everything&rdquo; &#x2013; physical or otherwise. Each of these TOE coherent in itself, valid in terms of &ldquo;empirically confirmed&rdquo; to high degrees and so on, as far as the scientific method allows.<br>
</p>

<p>
What we might find is that, taken these separate theories, there can be morphisms between them. These morphisms <i>are</i> what comes closest to &ldquo;ultimate reality&rdquo;. The &ldquo;ultimate reality&rdquo; is not in the instantiation (not physical), but in the translations between descriptions, and there can be <i>many</i>.<br>
</p>
</div>
</div>

<div id="outline-container-org3b6c009" class="outline-4">
<h4 id="org3b6c009"><a href="#org3b6c009">Relevant beliefs and values:</a></h4>
<div class="outline-text-4" id="text-org3b6c009">
<ul class="org-ul">
<li>Difference is profound<br></li>
<li>The beginning/end doctrine is a human invention<br></li>
<li>Circular dependence is legit; &ldquo;dependent origination&rdquo;&ldquo;<br></li>
<li>Coherence globally, fundamentals locally<br></li>
<li>No meaning without references and relations<br></li>
<li>Darwinian evolutionary processes are universal - same same, but different<br></li>
<li>Physical laws and phenomena are not prior (time, space, gravity)<br></li>
<li>There&rsquo;s no &ldquo;imperfection&rdquo; in nature, but complexity misunderstood<br></li>
<li>Desire for the absolute, closed, discrete, perfect, precise is a cognitive bias<br></li>
<li>The unfinished and infinite are not flaws, but the expression of becoming<br></li>
<li>Be careful with (ad-hoc) formal systems; they are tools, not truths<br></li>
<li>Mathematics is a conglomerate of formal systems<br></li>
<li>&rsquo;Closed systems&rsquo; are human invention<br></li>
<li>Be sceptic of classic logic, explore other logic frameworks<br></li>
<li>There might be no distinction between &ldquo;ontic&rdquo; and &ldquo;epistemic&rdquo;<br></li>
<li>&rsquo;Equality&rsquo; is a human invention, rooted in bias<br></li>
<li>Recursion is profound<br></li>
</ul>
</div>
</div>

<div id="outline-container-org98e0d32" class="outline-4">
<h4 id="org98e0d32"><a href="#org98e0d32">Cognitive object-heuristic and Platonic thinking</a></h4>
<div class="outline-text-4" id="text-org98e0d32">
<p>
While these heuristics are beneficial for practical purposes, they may also be limiting. This is reflected in the Platonic Ideals, and their postulate reinforced and encouraged a view of nature that seeks out unchanging laws and fundamental building blocks—the &rsquo;objects&rsquo; of the universe.<br>
</p>
</div>
</div>

<div id="outline-container-org2b18998" class="outline-4">
<h4 id="org2b18998"><a href="#org2b18998">Approximation and Uncertainty in Nature:</a></h4>
<div class="outline-text-4" id="text-org2b18998">
<p>
Our misunderstandings about uncertainty and approximation could be due to the habit of objectifying nature &#x2013; the permanent strive for completeness, closedness and discreteness. This objectification is obviously practical, but might lead to the erroneous assumption that approximations are merely tools for dealing with our imperfect knowledge, instead of potentially fundamental aspects of reality itself.<br>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author">Dan Dee</span> <span class="email"><a href="mailto:MonkeyJungleJuice@pm.me">MonkeyJungleJuice@pm.me</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
